{"text":"Packers and movers from Montreal to Victoria BC. Hello there! I hope everyone's having a good afternoon. \n\nI'm currently an International student in Montreal, and I'm moving to Victoria in April 2022 for my job. I have been living in Montreal with my partner for a while, and we already have a lot of furniture (a king-sized bed, a TV, a treadmill are the main components), along with a few cupboards\/wardrobes. \n\nDoes anyone know of any good\/reliable packers and movers who deliver and set up things all the way to Victoria BC, and help out with unpacking, installation? Alternatively, would you suggest selling the furniture and buying new ones once we reach Victoria?\n\n I know Montreal is very far away, so I was worried about the move to the west coast. If anyone has any similar experiences of moving to the west coast from the east coast, I'd love to hear your experiences on getting adjusted with furniture and basic equipments, and setting down. \n\nThank you!","label":1,"Predicted_Label":0}
{"text":"Are anti-development signs illegal in Oak Bay? - Academic says Oak Bay sign bylaw unconstitutional. ","label":0,"Predicted_Label":1}
{"text":"Renting a downtown bachelor in a Capreit building. Edit: updated my list with people’s feedback \n\nI’m hoping to move from Toronto to Victoria later this year. I’ve been looking at various affordable-ish buildings that might be a possibility to live in. I’d prefer to live alone, close to downtown, and avoid living in a basement, so one of Capreit’s relatively affordable bachelor units seems like a good option so far.\n\nIn Toronto, most people avoid purpose-built apartment buildings because they are terrible. I did some of my own research, and around 90% of apartment buildings in Toronto have cockroaches, and at leash 50% have or have had bedbugs or other pests. However, from my research so far, apartment buildings in Victoria seem a lot more decent (although I could be be wrong here).  \n\nA few of the buildings I have been considering are: \n\nYes: \nVictor Apartments: 976 Humboldt Street\nVancouver Villa: 710 Vancouver Street\nNiagara Court Apartments: 535 Niagara Street\n\nMaybe: \nAnondale Court: 443 Superior Street\nVilla Apartments: 788-790 Dominion Road\n\nNo: \nGorge Road Apartments: 215-221 Gorge Road East\nGraham House: 1110 Queens Avenue\n\nUnknown: \nValencia Apartments: 660 Niagara Street\nLord Harley: 3220 Quadra Street\n\nOther suggestions:\nContinental House on Lampson Street\n\nI am hoping someone may be able to provide experiences with these specific buildings, or renting from Capreit in general. I am also open to recommendations of other relatively affordable apartment buildings near downtown (ideally pet friendly, as I will likely have a small dog by the time I move). \n\nThanks in advance!","label":1,"Predicted_Label":0}
{"text":"Advice on Small Claims Court Case. We are currently in the following situation concerning a restoration company.\nIn our case we had a small leakage for which we reached out to our insurance for water damage in one of our room’s ceiling.They suggested a restoration company and we decided to go with them. Our place is almost 50 years old so they tested for asbestos in that rooms ceiling which came positive and they did the whole sealing on the room and abatement and everything and cut a hole in the ceiling and said it’s safe now and some other contractor will come to put in the new drywall. The guy who finally came was not briefed properly and started scraping the popcorn ceiling that had the asbestos while we were all home, with the doors open without even wearing a mask himself. We immediately stopped him and called the restoration company and asked them to remediate. We had to take the day off work, left our place, sent off the pets to sitters while we stayed with our friends. It was crazy how negligent they were even after all the asbestos testing and stuff. We thought we should definitely go to small claims against them. But we don’t know what the damages should be. Will it just be the deductible, but this is like negligence that can possibly affect health. How do we put a price on that. We did incur a bunch of other small costs but the inconvenience and the stress is the worst part about it. And will it be the insurance company or the restoration company that we go against. We are first time home owners, this is all new for us!","label":0,"Predicted_Label":1}
{"text":"Nagasaki survivor still haunted by scenes of atomic blast - Saanich News. ","label":0,"Predicted_Label":0}
{"text":"Czech musicians celebrate new honorary consulate with Oak Bay performance - Classical concert From Prague With Love is Oct. 29 at Oak Bay United Church. ","label":0,"Predicted_Label":0}
{"text":"Stolen Gio e-bike from Glanford School area. Hey, Reddit. Sometime last night\/this morning my scooter was taken right off my front yard; wheel lock was on and I have the keys, so the only way it went anywhere is if it was picked up and carried away.\n\nI know how you all feel about these things and how you prefer them off the roads but I bought it used to commute to and from work, particularly after work past 2AM after the buses stop running. Without it I have no way to get to and from my job (a 25-35 min scoot at 32km\/h), and I'm struggling to make rent as is, let alone buying a replacement. Gas and insurance on a car would put me under, and I'm recovering from an mishap earlier this month that had me miss a week of work. I don't know how I'm going to recover from this point forward if I don't get my only commuter back.\n\n[Here's the closest approximation on Google; the one I lost has a more intact front.](https:\/\/dygtyjqp7pi0m.cloudfront.net\/i\/34656\/30296831_1.jpg?v=8D5D23F6D870110) When it's on, the only lights that still work are the front right headlight, turn signals and brake lights; there's also a panel on the back left held on by electrical tape. I was planning on getting it repaired after this rent paycheck, but, uh, not anymore.\n\nPlease let me know if you know *anything* about this.\n\nThanks.","label":0,"Predicted_Label":0}
{"text":"Ma Millers Pub confirms it will be closing for good this Sunday. ","label":0,"Predicted_Label":0}
{"text":"Esquimalt Road closed between Head and Lyall. Powerline damaged pretty hard, no one is allowed near.. ","label":0,"Predicted_Label":0}
{"text":"Cheap groceries!. Hey y'all, due to an overlap in day care and my wife coming back to work after mat leave, I'm having to dip into the old emergency fund to meet the basics this month after rent and bills. Very painful for me, desperately trying to build some semblance of financial stability after a decade of devil-may-care living. \n\nNormally I give my money to Save-On, but I've heard Whole Foods may be cheaper. Anyone have any experience with general price comparison in shop around town? We don't eat meat, but don't go for high priced organic scams either.","label":0,"Predicted_Label":0}
{"text":"'Very rare' King-of-the-Salmon fish found on Vancouver Island beach - Ben Baker spotted the fish at Rattenbury Beach in Oak Bay. ","label":0,"Predicted_Label":0}
{"text":"Victoria’s oldest pipes to be replaced this year - The pipes along Cook Street were installed in 1891 and are made of bricks. ","label":0,"Predicted_Label":0}
{"text":"Best rain pants that don’t look like rain pants. Just took the dog for a walk in the pouring rain.   Is there a comfy, waterproof walking pant that doesn’t make it look\/sound like I’m about summit Everest or go fishing?  What’s out there that I don’t know about??!\nLooking for men’s, but I assume this isn’t a men’s only problem.","label":0,"Predicted_Label":0}
{"text":"I’m happy for Victoria’s strength but still very scared. With the protests that happened yesterday I’m very happy that Victoria showed overwhelmingly what side we are on but I’m still terrified.  Like Canada was supposed to be the best place for gender and sexual minorities, but now it feels like it’s not even that safe for us trans people in this country anymore.  I’m just anxious and exhausted by it all.","label":1,"Predicted_Label":0}
{"text":"University of Alberta Sexual Assault Centre signs Jama's letter denying Jewish rapes [along with Victoria Councillor Susan Kim]. Surprised and disappointed to see that the open letter, signed by only two active politicians in Canada, had Susan Kim's name on it. I suppose this explains her defensiveness on twitter.","label":0,"Predicted_Label":0}
{"text":"Victoria to Vancouver foot-passenger only ferry to and from inner harbours?. Has any proposal been made to suggest a regular foot passenger ferry service from Victoria\/Vancouver from each of their inner harbours?    \nSeattle Clipper style, full throttle, no frills. Strap in and go.      \nImagine a service that took you right downtown without the hassle of dealing with highway traffic on either side.    \nCould the ferry corp create a cost analysis for to build our but four or more high speed, small passenger marine vehicles to transport passengers to the city centres.      \nHow much would you pay for a return ticket for a ride downtown by boat?","label":0,"Predicted_Label":0}
{"text":"How many \"Health Advocacy centres\" or grey area dispenseries are there in Victoria now?. I've seen a few new ones open up recently (one on rock bay, another across from hillside mall) and was just wondering how many there are now. Anybody have a list? ","label":1,"Predicted_Label":0}
{"text":"Todays Sunset from Esquimalt. ","label":0,"Predicted_Label":0}
{"text":"The Rise of Coworking Spaces in Victoria - A New Way of Building Community — Sidewalking Victoria. ","label":1,"Predicted_Label":0}
{"text":"Royal B.C. Museum apologizes after 2017 carving declared ancient Indigenous artifact. ","label":0,"Predicted_Label":0}
{"text":"Moving Victoria or Sooke single M47\/dating\/living\/loneliness etc. Looking to move to Vancouver Island, soon to be divorced but don't want to end up in the wrong area. Sooke looks beautiful with the types of houses I am looking for, Victoria super expensive and none of the houses I particularly care for. Main reason for moving is my daughter lives in Vic and is renting. I am thinking of buying a duplex and she can help with the mortgage and she is keen and wouldn't mind the security.\n\n&#x200B;\n\nMost houses in Vic in this category are super unattractive and small but perhaps I need to sacrifice what I like for the greater good and avoid the loneliness or buy a house in Sooke which will be nicer and more my style, Any advice or suggestions would be appreciated.\n\n&#x200B;\n\nI can work from home, so the commute wouldn't be an issue or though I do worry about losing my job and then needing to commute. I am also a 47M looking to date at some point in the future when I recover, probably 2 years from now or so, but do worry about the dating scene in Sooke for older males.\n\n&#x200B;\n\nTL;DR: Love the house style in sooke, worry about dating scene\/commute to vic. Want to be close my daughter to help thru this dark time in my life.\n\n&#x200B;\n\nThanks","label":1,"Predicted_Label":1}
{"text":"Anyone Lose a Dog in South Colwood\/North Metchosin?. Driving home on Metchosin Road just now I spotted a black and white husky roaming the shoulder\/ditch just south of Farhill Road. I pulled over and could tell it had a collar with jangling tags, but I couldn't coax it close enough to get under control. It was not being particularly road smart, crossing back and forth over Metchosin Rd and stopping in the middle several times. A military police officer puled over and after I told him about it went back over the area with his searchlights, but by that point the dog seemed to have moved away. We agreed there was no point bushwhacking to try and find it and he said he'd do a couple more passes with his lights, but I'm fairly certain it had moved into the forest. Theres houses pretty close off Metchosin Rd in that spot so its very possible it was just roaming from one of those, but it did not seem to be road smart at all and I was worried about it getting hit. Not sure what else there is to be done, just wanted to share the word.","label":0,"Predicted_Label":0}
{"text":"Saanich partners with UVic to solve real-life engineering problems - Civil engineering students focused on Larchwood corridor near McKenzieAvenue and West Saanich Road. ","label":0,"Predicted_Label":0}
{"text":"Province seeks forfeiture of Victoria house allegedly linked to drug trafficking. ","label":1,"Predicted_Label":0}
{"text":"A four-part plan to improve downtown Victoria. ","label":1,"Predicted_Label":0}
{"text":"Any part-time automotive courses?. I'm not looking to become a certified technician, I just want to get some practical experience working on cars under a knowledgeable instructor.\n\nI haven't been able to find anything in Victoria through community colleges or rec centres, the closest I've found was the full 40 week course offered at Camosun. \n\nAnyone know of anything?","label":0,"Predicted_Label":0}
{"text":"Timing the Victoria housing market. ","label":1,"Predicted_Label":1}
{"text":"Beacon Hill Saturday. ","label":0,"Predicted_Label":0}
{"text":"Last chance to say hello to the future - Saanich 150 time capsule on display at municipal hall. ","label":0,"Predicted_Label":0}
{"text":"Recommendations for area to stay. Hi Victoria peeps,\n\nI am coming to work in\/visit your fair city for a month in Sep\/Oct. I will be working between Victoria General and the Royal Jubilee, and would ideally like to not rent a car, and would be cycling between the 2 sites and wherever I am staying. I will not need to travel between the 2 sites mid-shift. \n\nOtherwise, I am a young Irish guy who likes a bit of the outdoors\/nightlife\/café culture\/just a general vibe. \n\nAny pointers would be greatly appreciated. Thanks in advance.","label":0,"Predicted_Label":0}
{"text":"*affordable Group fitness. I am wondering if anyone has some advice on Vic’s fitness scene. In an ideal world I would like to find a group fitness program that meets three times a week that is supportive and inclusive and will push me to improve my fitness and show me great compound exercises. Equipment like bench press and kettle bells would be used. Yes, it would look a lot like cross fit. I have looked into doing that but at this point I can not afford. \n\nDoes anyone run these sorts of things in a non professional context? Like for example, I worked out a lot at Central middle school this summer, and you could conceivably run something like this if you could bring together like minds with enough knowledge to develop routines? Or are there CrossFit type programs that are a bit less pricey?\n\nIt would be great if this program was outdoor as well, though that might be a tall order. \n\nI ask because I did a program in whistler and it was amazing. Super supportive and well run. It was expensive though. \n\nThanks - and wishing everyone well In their health journey :)","label":0,"Predicted_Label":0}
{"text":"A website to see the estimated wait times at polling stations?. I live in Victoria proper, and my building neighbours are reporting 90 minute waits at our nearest polling station. Friends in other neighbourhoods are reporting as fast as 15 minutes or 30-45 minutes.\n\nI do not have an hour and half to wait in line. \n\nIs there any website or app to tell me what average durations are ? Should I wait until supper time to go?","label":0,"Predicted_Label":0}
{"text":"People who have experiences homelessness in Victoria, please tell us about your experience!. Hey!\n\nI'd like to know about stories of what happens after people realize that they don't have anywhere to stay at night and need support finding a shelter?\n\nI realize that there are a lot of shelters in Victoria, but there must be a reason why there is still a TON of people living on the street, maybe because the shelter didn't approve of them consuming substances on site, or something else.\n\nI also want to know what happens, for example if you don't have any issues with drugs, or the law, and just find yourself in not having a place to sleep for a while. Are some places safer than others? \n\nIf you did experience living outdoors, I would love to hear about your experience with that too!\n\nThanks!","label":1,"Predicted_Label":1}
{"text":"Freight train derails in Delta early Sunday morning. ","label":0,"Predicted_Label":0}
{"text":"Very wealthy Centurion (Danbrook\/Ridgeview) says Langford needs to pay for displaced tenants. “We are actively advocating for the City to take additional measures to better support residents. We know that the City has also been disappointed by this situation, but hope that both parties can focus our immediate energy on the needs of RidgeView Place residents,” the company added.\n\nThis can’t even be real. This very wealthy mega real estate corporation is putting the focus on their displaced tenants at the feet of the city of Langford.","label":1,"Predicted_Label":0}
{"text":"$87M arts and culture hub planned for Langford (going into area being cleared behind Costco). ","label":0,"Predicted_Label":0}
{"text":"Walking With Bruce. This is why I live in Brentwood Bay on Vancouver Island.. ","label":0,"Predicted_Label":0}
{"text":"Official petition to re-start Vancouver Island rail from Victoria to Campbell River. https:\/\/petitions.ourcommons.ca\/en\/Petition\/Details?Petition=e-4576\n\nHey folks, not sure if previously any such petition made it this far, but this one is being supported by an MP and is currently the official petition that will be presented to the House of Commons in January 2024. If you wish to have rail based transportation on the Island, please please sign! \n\nEveryone has their opinions on this negative, positive neutral and sarcastic and there have been many debates on this subreddit, but those who feel a railway would be beneficial to the Island, please do sign! \n\nIts the Democratic way to bring a change, other than voting.","label":0,"Predicted_Label":0}
{"text":"Looking to volunteer in Victoria. What places need help amidst COVID?. Hi! I am a student who’s prospects for summer work have greatly diminished due to COVID and I was wondering what places are still up and running and need help? I’m not sure which volunteer based services have ceased due to the virus and which have ramped up their services. Thank you for any insight about where to start looking.","label":0,"Predicted_Label":0}
{"text":"Saanich’s Regina Park, Rudd Park to remain open for temporary overnight sheltering - Staff recommends council reduce the list of eligible parks by 25 to 81. ","label":1,"Predicted_Label":0}
{"text":"Soprano's staff busted for selling drugs. ","label":0,"Predicted_Label":0}
{"text":"Solar self-sufficiency possible, but not feasible in coastal B.C., researchers find - British Columbia - CBC News. ","label":0,"Predicted_Label":0}
{"text":"Merry Fuckmas! Courtesy of a midnight Christmas eve visitor in Vic West. ","label":0,"Predicted_Label":0}
{"text":"Frustrating Saanich intersection takes a new turn - New turn comes after lobbying from Saanich. ","label":0,"Predicted_Label":0}
{"text":"Street art on Lochside news Quadra and Mckenzie. This piece has been recently modified, says rest in peace, and there's flowers in the fence. I walk by here somewhat regularly and really like the street art here. Does anyone know the details?","label":0,"Predicted_Label":0}
{"text":"Suggestion - will the Victoria sub join the reddit protest on June 12 and go dark for a day or two? Mods, users, what do you think?. A lot of reddit is going dark on June 12, to [protest reddit's decisions around API access](https:\/\/www.socialmediatoday.com\/news\/thousands-of-subreddits-set-to-go-dark-next-week-in-protest-over-api-pric\/652113\/) which has already affected a lot of mod work for making reddit less affected by spam and such (ie, making mods' jobs more difficult). On the user end, apps like Apollo and others will be severely affected. There's also an AI angle here I haven't looked much into.\n\nSome of the biggest subs on reddit, including the [formula one group](https:\/\/www.reddit.com\/r\/formula1\/comments\/141jtll\/were_joining_the_reddit_blackout_from_june_12th\/), nfl groups, hobby groups and more are going dark on June 12-14. \n\nI would suggest that Victoria goes dark as well in that time frame. Thoughts?","label":0,"Predicted_Label":0}
{"text":"Man Arrested In Saturday Morning Beacon Hill Park Assault With Weapon. Patrol officers have taken one man in to custody, while another remains in hospital with non-life-threatening, but potentially life-altering injuries. after a reported assault with weapon in Beacon Hill Park early Saturday morning.\n\nPatrol officers were called to Beacon Hill Park for a report of an assault with a weapon just after 1:00 a.m. Saturday morning.  Officers located the victim and a short while later, identified and located a suspect. The suspect was taken into custody. He has since been released on a number of strict conditions. \n\nInvestigative Services Major Crime Unit detectives and Forensic Identification investigators are continuing to investigate this file. More updates will be shared as our investigation progresses.\n\nIf you have information on this incident you are asked to call our non-emergency line at (250) 995-7654. To report what you know anonymously, please call Greater Victoria Crime Stoppers at 1-800-222-8477.\n\n\/u\/osoko here","label":0,"Predicted_Label":0}
{"text":"Pharmacies that aren’t slammed?. My wife and I have always used the pharmacy at London Drugs tillicum but recently we’ve been having trouble. They are always so slammed and busy. They can’t fill prescriptions quickly, they don’t seem to process their inbound prescriptions quick enough, and they won’t fill any inbound faxes without confirmation from the patient anymore. Once you notify it can be days before being able to pick up, and line for picks ups is always a mile long and a long wait too.\n\nNeedless to say we are wanting to change. Gone are the days of 15 minute walk around the store until they page you prescription fills.\n\nI know the healthcare system is in crisis right now, but are all pharmacies like this these days? Can anyone recommend an alternative?","label":0,"Predicted_Label":0}
{"text":"Protest hits office of Saanich MLA Lana Popham - Peninsula News Review. ","label":0,"Predicted_Label":0}
{"text":"‘Betrayed by the system:’ Family of murdered Langford teen outraged killer has applied for day parole. ","label":0,"Predicted_Label":0}
{"text":"On Thursday Victoria City Council will consider a 40 bed permanent supportive housing facility in Vic West at 225 Russell Street; if you care about housing and homelessness in the city please consider writing an email to council in support of this project. BC Housing and the Our Place Society are currently running a 50 bed emergency shelter at this site similar to the hotels that they started running over covid, the plan is to convert this former warehouse site in a mixed light-industrial \/ residential area into 40 \"self-contained permanent supportive residential homes\"  with 24\/7 on site staff. Each unit would have its own bathroom and kitchen, and most crucially just be a private space with a lock on the door, which is what a lot of people really need to actually get back on their feet. \n\n&#x200B;\n\nCurrently a lot of the emails council has received on this have been from neighbours basically saying \"put it somewhere else\" or truly just \"not in my backyard\". I understand that most people would not be crazy  about a supportive housing facility being built next door to them, but I think we can all recognize that as a society we need these things and if we killed every project because a neighbour objected then we'd get nothing built in the end. We know that concentrating all the social housing and social services in the city in one neighbourhood leads to bad outcomes, it concentrates poverty, makes most people just avoid that area, and leads to exactly what we have in some parts of downtown and Harris Green currently. If you had a drug addiction you were trying to recover from or mental health issues that were seriously affecting your life you probably wouldn't do too well if the only supportive housing you were offered was right on the 900 block of Pandora, we have to give people the opportunity to get out of that environment, and housing facilities like this do exactly that.\n\n&#x200B;\n\nSo please, sit down after work today for five minutes and type out an email to council. You can send your letter to [mayorandcouncil@victoria.ca](mailto:mayorandcouncil@victoria.ca) and it will be forwarded to all councillors and the mayor, as well as being published permanently in the agenda for Thursday's meeting with your email redacted (though nothing else is). \n\n&#x200B;\n\n* You should include the address of the site (225 Russell Street) in the subject line of your email\n* Start with saying you want them to support the project\n* Be professional, polite, and say **why** you want them to support the project\n* Sign off with your actual name, and if you want your address or just the neighbourhood you live in\n\n&#x200B;\n\nSo please, if you've ever complained on here about homelessness in the city, about the housing crisis, or about \"the state of downtown!\" actually write in to council on this project, because I guarantee it will do more than just talking about the issues here. I've included some links about the project below if you want to read up on the details.\n\n&#x200B;\n\n[Thursday's agenda](https:\/\/pub-victoria.escribemeetings.com\/Meeting.aspx?Id=059a3bc3-b155-4691-9014-7eb0efd42005&Agenda=Agenda&lang=English&Item=11&Tab=attachments)\n\n[Letter from BC Housing](https:\/\/pub-victoria.escribemeetings.com\/filestream.ashx?DocumentId=81217)\n\n[The current letters, including one complaining about the area being \"inundated with seagulls\"](https:\/\/pub-victoria.escribemeetings.com\/filestream.ashx?DocumentId=81220)\n\n[BC Housing page on the site](https:\/\/letstalkhousingbc.ca\/victoria-225-russell)\n\n[Citified article with some fairly optimistic renders](https:\/\/victoria.citified.ca\/news\/vic-wests-russell-street-shelter-re-envisioned-as-40-unit-supportive-housing-complex\/)","label":1,"Predicted_Label":1}
{"text":"BC housing minister responds to criticism with “I guess some people just have to get up and whine every day, I don’t know”. ","label":0,"Predicted_Label":1}
{"text":"Chrissy Brett arrested. Chrissy Brett was live streaming on FB from Woodwyn Farms which is where they went after being kicked out of Oak Bay. She was mouthing off to the police about letting them get a uhaul to pack up. She was carrying on about them carrying guns and belittling them. The video ended with an officer approaching her, the camera going to black and the officer saying \"You're under arrest\".\n\nFrom what I have read, they cut a lock to access Woodwyn farm which is private land.\n\nStory on Victoria Buzz http:\/\/www.victoriabuzz.com\/2018\/10\/homeless-encampment-organizer-chrissy-brett-arrested-in-central-saanich-video\/\n\nEdit: found this shared on FB\n\nFrom Central Saanich Police\n\nIncident: Unlawful Occupation and Arrests at former Woodwynn Farm Property  \n\nFile Number: 2018-2207\n\nOn Friday, October 19, 2018 just after 10:00 p.m., a group of approximately ten individuals removed gates to gain access to the agricultural property located at 779 West Saanich Road. This location was formally known as Woodwynn Farms and is now owned and managed by the Provincial Rental Housing Corporation. The individuals drove vehicles onto the property and began establishing an encampment. \n\nCentral Saanich Police Service officers responded and met with the organizer and several members of the group who identified themselves as the Namegans Nation or Camp Namegans. Police also spoke with representatives from BC Housing who instructed the police to remove the individuals. Repeated attempts to have the group voluntarily leave the property were unsuccessful.\n\nThis morning, officers spoke with the organizer and provided the group with another opportunity to leave the property voluntarily. The group chose to barricade the entrance to the property.\n\nAt 3:00 p.m., members of the Central Saanich Police Service, with the assistance of the Greater Victoria Crowd Management Unit and the RCMP, attended the property and arrested ten individuals for the criminal offense of Mischief.  The individuals are being released on conditions including not to return to the property.\n\nEdit: thank you \/u\/Aaera for the silver :)\n","label":1,"Predicted_Label":0}
{"text":"Emigrate to BC as an International Student?. Hi guys, I’m a Mexican guy who is trying to develop a good strategy so as to emigrate to Victoria BC and get a PR, that's my current life goal, I would like to make you a couple of question, so I can get a general overview on how does the daily life in Victoria is actually like If you could help me by giving me some answers you would make my day :)\n\n1 - What would be the cheapest area to rent a student room in a shared House \/ Apartment outside Victoria’s downtown, I’ve heard about surrounding places like “Saanich” or “Oak bay” but I don’t have a clue. I’ve seen many places on Kijiji with prices of 550-650 which happens to be my budget, and it's cool (I don’t really care about taking 30 minutes to travel on the bus every day since where I live we’re used to taking 40min-2 hours one every day, yes I know it’s crazy hahahahaha xD)\n\n2 - I’m thinking on study “Hospitality management” at Camosun College. If we talk about the “pre-covid” daily life, do you think the Hospitality\/Tourism industry is a good labour market in Victoria? Based on your local perspective would you say It’s strong enough to find a Job classified NOC B after graduation?\n\n3 - I’ve heard that there are many “Thrift stores” and “Banks of food” that can help you to save money, are these institutions a good chance to do so? Or I’d better not bank on them as an option?\n\n4 - Is it difficult to find a part-time job as an international student when you live in Victoria? Does it take too long to get one? I feel My English is not terrible but isn't really good as well.\n\n5 - Any recommendations you guys can provide me to make a good strategy?\n\nPD if you read everything and took the time to eventually answer me then I promise I’ll buy you a beer one day :,D xD have a nice day","label":0,"Predicted_Label":0}
{"text":"FOI request reveals government mismanagement of tent city situation. I submitted a FOI request with the BC Government a few months back about tent city. I just couldn't understand how they let the camp get so out of hand.   &nbsp;\n\nHere are the \"responsive records\" to my request:  &nbsp;\n https:\/\/drive.google.com\/open?id=0B1BLCxfxyTiLNTdUQlhyWXN1cVU (PDF)   &nbsp;\n https:\/\/drive.google.com\/open?id=0B1BLCxfxyTiLSzJzeVdJdHZaSE0 (OCR .docx)  &nbsp;\n\n\nIt looks like the landlord (being the Real Estate Division) of the land requested that the Victoria Police remove the campers back on November 20th, 2015:  &nbsp;\n\n>From: Sykes, Graeme MTiC:EX\n>Sent: Friday, November 20,2015 10:12 AM\n>To: McGregor, Scott\n>Cc: Brown, Colin; Wharton, Peter jAG:EX\n>Subject: RE: Homeless encampment \n\n>Hi Scott\n>This morning at 9am there were approximately 14 tents located on the Courthouse Greenspace (attached photo).\n>I respectfully request that VicPD attend the site and do your best to disband the encampment, before the activity becomes even more entrenched.\n>My goal is to secure a decision on long term site usage and site rules prior to year end. So far, we are on track for that goal. Unfortunately, events on the ground are fast overtaking option development and stakeholder engagement.\n>Your assistance in the near term is greatly appreciated,\n\n>Graeme Sykes Real Estate Manager\n>Real Property Division | Ministry of Technology, Innovation and Citizens' Services (250) 217-3Q27  &nbsp;\n\n\nBut that conflicted with the wishes of Assistant Deputy Minister of Justice Lynda Cavanaugh (the tenant of the land), which was that the police do nothing.   &nbsp;\n\n\n>From: Melvin, Stephanie JAG:EX\n>Sent: Tuesday, November 17, 2015 10:42 AM\n>To: Wharton, Peter JAG:EX; Eggleston, Darcy JAG:EX; Cooper, Shelia JAG:EX\n>Cc: Corrado, Paul JAG:EX\n\n>Subject; RE: Homeless encampment\n\n>Thanks for this Peter. We need to stand down on this issue and focus on other priorities, [redacted] .Thanks for >the followup, but unless our campers are directly interfering in a serious manner with the use of this building or >the safety of our Courthouse users, there is nothing to be done at this point.\n\n>Thanks again\n>Stephanie  &nbsp;\n\nAs confirmed by VicPD's Scott McGregor:  &nbsp;\n\n>McGregor, Scott <scott,mcgregor@vicpd.ca> Friday, November 20, 2015 2:30 PM \n>Sykes, Graeme MTICEX; Whittier, Joanne GCPE;EX Brown, Colin; Wharton, Peter JAG:EX \n\n>RE: Homeless encampment\n\n>Thank you Graeme for outlining the breakdown of Ministries and positions with interest in this property.\n>We have received direction (since your previous email) from Stephanie Melvin that the Campers are to be left alone and that they are not asking for any assistance at this time from the VicPD.\n\n>Ms, Melvin confirmed for me that this direction has come directly from ADM Cavanaugh.\n\n>We have communicated our concern to ADM Cavanaugh that things could escalate if allowed to continue on the property without any form of management. We have asked to open a dialogue with her and have offered our assistance in developing a strategy to deal with the current situation and to assist with developing plans moving forward concerning the management of the greenspace as it relates to the homeless population.\n\n>For example, every morning when the VicPD awaken homeless persons in the parks this provides us with opportunities to assess many things such as their exposure level to the elements, mental health status, physical health status, and many other vulnerabilities. We connect them at these times with mental health teams, connect them with housing providers, at times take them to hospital, or call the ambulance if they need immediate medical attention, in addition to that, because they are on City property, the Parks Department comes and deans up accumulated garbage, needles, and human waste. The public works department then hauls all of that away to be disposed of properly.\n\n>Because the space they currently occupy is not on City property none of that management outlined above is happening. In effect, if the people there are allowed to continue to occupy the space, unabated, unrestrained and unmanaged it will be akin to actually creating greater vulnerabilities for them. The likelihood of an assault, overdose, exposure or other incident occurring increases as the population grows without arty form of management.\n\n>One other point that was communicated to ADM Cavanaugh through Ms. Melvin was that there is green space in City Parks available all over the City. The people that are taking shelter on the grounds of the Courthouse are not doing so because there is nowhere for them to go. it is our experienced belief that they are taking up sheltering on that space because they are not being compelled to pack up every morning and move off the grounds.\n>As we have communicated our concerns to ADM Cavanaugh in writing the VicPD, respectfully will not be taking any action until we have received a response from her directly.\n>May I ask whether there has been communication between the two Ministries you've outlined below with respect to this issue been initiated?\n\n>Regards,\n>Scott\n\n>Inspector Scott McGregor\n>Focused Enforcement Team Victoria Police Department","label":1,"Predicted_Label":0}
{"text":"Oak Bay woman files Human Rights complaint over speculation tax. I could have easily made the title 'Oak Bay woman equates tax payers with criminals and money launderers, tries to exploit her children for financial gain.'  \n\n\nI'm on the fence as to whether this family that pays no personal income tax in BC should be paying the speculation tax. But I'm quite certain that no one is calling her a criminal or money launderer, and equating people who pay the tax to criminals and money launderers is both asinine and a little bit racist. Also, this has nothing to do with the fact that she's a mother and\/or stays home to raise children, and it's certainly not setting women back decades. \n\nEnjoy Ontario Melany. \n\n&#x200B;\n\n [https:\/\/www.cbc.ca\/news\/canada\/british-columbia\/b-c-s-speculation-tax-that-sets-back-women-many-decades-faces-human-rights-complaint-1.5480412](https:\/\/www.cbc.ca\/news\/canada\/british-columbia\/b-c-s-speculation-tax-that-sets-back-women-many-decades-faces-human-rights-complaint-1.5480412)","label":1,"Predicted_Label":0}
{"text":"Illegal basement suite in saanich. I got the phone call I've been dreading for 10 years: \"Hi this is Saanich By-law, we have a report of an illegal suite.\"\n\nI own the home and rent it top and bottom. It's gorgeous and I rent it for below market rates. Next week Saanich will come to inspect it. And according to Landlord BC they will force me to kick the downstairs tenants out with probably 1 months notice. The downstairs tenants are fantastic in every way and I am dreading telling them the bad news today. \n\nIs there another landlord out there that has been through this situation?","label":1,"Predicted_Label":1}
{"text":"Angry guy at the downtown Tim Hortons (Pandora and Blanchard) this morning. Interesting morning, stepped into Timmies to grab a coffee just after this guy goes in...clearly agitated.\n\nTries to pay with a Tim's card that looked like it had been lying on the ground for a while. Zero balance. Immediately loses his shit, demands a Muffin from the teenager behind the counter. \"Just gimme a fuckin Muffin\" was what I heard. Teenager says no. Two teenage girls, also behind the counter, near the sandwich station are definitely very scared.\n\nGuy kicks over a bunch of chairs, squares up with a guy who just walked in and just starts yelling at random people all the way down the street.\n\nThere is about 10 people in the shop, everyone is stunned, motionless. You could hear a pin drop. One customer says \"should we call the cops\". Another chimes and says \"No, he's just coming off those hard drugs, just leave him alone\".\n\nNothing happens, I carry on and buy my coffee and go home. What do you think? Should the police have been called? I'm no stranger to drug addicts\/homeless making a scene, but I've never seen this level of anger and desperation. Imo, if this guy doesn't get a fix soon, good chance he might hurt someone...or himself.","label":0,"Predicted_Label":0}
{"text":"Moving to Victoria. Looking for advice on areas for my family.. Moving to Victoria. We have three young kids (under 12) and have a budget of $1.2M. What area would offer good sized homes near good schools? \n\nWe don’t want to be as far as Langford or Sidney etc. We like Cordova bay and Gordon head but don’t know the areas well enough. \n\nOak bay is great but my wife won’t let me sell our first born (yet).","label":1,"Predicted_Label":0}
{"text":"Stephen Andrew wants to know your thoughts on his vote to reject constructing affordable housing. ","label":1,"Predicted_Label":1}
{"text":"Report defines housing affordability in Saanich: $428,000, $605,000. Saanich, making some headlines lately....\n\nNow this is pretty depressing, but good for them to *actually* define what affordable means, instead of just throwing around the term with no reference like they do in the CoV.\n\n[https:\/\/www.timescolonist.com\/local-news\/depressing-report-defines-housing-affordability-in-saanich-428000-605000-7011662](https:\/\/www.timescolonist.com\/local-news\/depressing-report-defines-housing-affordability-in-saanich-428000-605000-7011662)","label":1,"Predicted_Label":1}
{"text":"Affordable junk removal?. Hey I was wondering if anyone could recommend some affordable junk removal companies? \n\nI just need to get rid of an old makeup desk and a futon. Thank you!","label":0,"Predicted_Label":0}
{"text":"Affordable Child Care Benefit’s arrival applauded by advocates Will it help in Victoria?. ","label":1,"Predicted_Label":0}
{"text":"Affordable artist space (shed\/garage\/etc). Searched the usual suspects, ie. kijiji, usedvictoria, craigslist and google. Has anyone have any idea where to find a working space for not a lot of money? realistically no larger than 10'x10' will require 120V outlet. Prefered location would be d\/t, vic west or esquimalt. Thanks!","label":0,"Predicted_Label":0}
{"text":"Affordable Plus Size\/Big and Tall Suits in Victoria?. I'm getting married and, being a) a lady and b) not very fancy, I know absolutely nothing about suits. Price points, what's fashionable, how measurements work.. it's all foreign to me. \n\nMy fiance wants all of the groomsmen to wear matching navy suits. Okay, that's cool, the problem is that while most of the groomsmen are pretty average in terms of clothing size, my brother has got more to love (I think he usually wears XXL or XXXL in shirts, but that's all I really know about his size).\n\nI'm looking for somewhere with bigger-sized suits to rent or buy that are affordable but not ugly, for heck's sake. I have no idea where to start and with all the other wedding planning we gotsta do, I would like to narrow the hunt down to 2 or 3 suit shops rather than dragging my brother all over town.\n\nAnother question for you suit-wearing types, we were considering getting the groomsmen to rent their suits as we are all young and poor, but apparently that doesn't actually end up costing much less. Any knowledge\/experience in that area is also very much appreciated.\n\nThank you, fellow Victorians!","label":0,"Predicted_Label":0}
{"text":"Secondary suites provide affordable housing in Victoria. ","label":1,"Predicted_Label":1}
{"text":"Times Colonist Trolled by NewCouncil Supporter. This letter by ~~an investment banker~~ financial adviser who signed Randie Johal's nomination papers was published in the Times Colonist on October 24:\n\n> **Victoria at last has council it deserves**\n\n> Victoria finally has the city council we deserve. Ben Isitt, Jeremy Loveday and Together Victoria have a mandate, and progressive values demand that they follow through on their promises:\n\n> Build 10,000 new affordable homes and rental-only homes in the city. Make the fat-cat developers sell half of any new buildings as affordable housing. As Isitt said, we need a “massive expansion of decommodified, state-owned and state-supported housing.”\n\n> Stop catering to car drivers, put the bike lanes down Cook Street where they promised. Support homeless camping in city parks until permanent shelters are built.\n\n> Help reconciliation with Isitt’s idea to rename Victoria to Camosack. Ensure that the statue of colonizer Sir John A. Macdonald never sees the light of day.\n\n> It’s time to make good on Isitt’s promise to open the public treasury for the common good. Push forward on his plan for a municipal income tax. Cut the police budget and reallocate that money to social justice.\n\n> Don’t let the regressive types win. Isitt, Loveday and Together Victoria have a progressive plan and control council. If not now, when?\n\n> Pete Jando","label":1,"Predicted_Label":0}
{"text":"Victoria sees 34 per cent decrease in home sales, increase in prices. ","label":1,"Predicted_Label":1}
{"text":"Fun things to do for a staff party (with alcohol)?. Hey guys, we're looking to throw a first time staff party in the new year, looking for somewhere with fun activities AND alcohol. Any suggestions for around 30-35 restaurant employees?\n\nPS As much fun as the Board Game Café is, maybe a little something with less...focus required.","label":0,"Predicted_Label":0}
{"text":"Are there any liquor stores open today? (Christmas Day). Having a mimosa related emergency","label":0,"Predicted_Label":0}
{"text":"Residents of Victoria’s newest homeless camp to list demands in press conference. ","label":1,"Predicted_Label":0}
{"text":"Is there an RV rental service on the island where they'd tow the RV right to the campsite for you?. Trying to convince some friends to go camping (Miracle Beach), but they don't like sleeping in tents. I've vaguely overheard people talking about being able to rent a camper and they'll tow it to the campsite for you. Does anyone have any recommendations? Thanks","label":0,"Predicted_Label":0}
{"text":"The mobile shower paid 142 000 $ to clean the homeless does not show up.. Resident of Beacon Hill Park since June 2020 never had the opportunity to see or clean themselves in the [mobile shower](https:\/\/www.timescolonist.com\/news\/local\/salvation-army-to-run-mobile-shower-service-for-people-without-homes-1.24250177) as it does not show up.\n\n \n\nAway from the absurdity that 142 000 $ is the cost to run a 4 months mobile shower that does not appear, grace and rewards goes to \"Food not bomb\", \"the Red Cedar Cafe\" distributing food and care on a volunteer base shows once it for all the calumny of the societal service capitalized on the mentally damaged and handicapped that are named homeless.\n\n\n\n\nThe homeless community stepped out of the mud like a lotus flower and built a shower and a care tent in Beacon Hill Park to provide heat, clothing and moral support for free run 24\/7 was taken down instead  of improving it to regulation.\n\n\n\n\nThe ethical dimension spirals down further on all levels: \n\n\n\n\nThe capitalization of housing is at $1000\/ month for a minimum space, as well as the am pathic sense of belonging does not improve for the housed community where the most viceful and intelligent lead the economy, the forbidness to gather expresses the apathy raised as head of the economy. \n\n\n\n\nNor health nor safety matters as much as capital, 40% of the supermarket food is wasted in lock bins, protected natural area in Beacon Hill Park looks good but all industries that see their capital at stake kill the new technologies that may replace it regardless of the environmental defects gifted to future generations.\n\n\n\n\nEthic will not come from above in a rural area, only the open hearts and compassion found within every people will beneficiate to all, all mean well, all mislead: an ethical structure is needed to counter the corporocratie in veil, to counter this creeping totalitarism where temptation and planned obsolescence pollutes.\n\n\n\n\nI raise the spirit of all people in Beacon Hill Park and around to not comply to oppressing laws, the people will rule over the few once compliance is deemed impossible by the bylaws.","label":1,"Predicted_Label":0}
{"text":"Current E-Scooter Law Situation in Victoria. Hey Everyone,\n\nSo I'm looking into getting an e-transportation device (e-bike, or scooter), but prefer to buy from a local shop because It was absolute HELL trying to find someone to work on my $2,500 VoltBike e-bike, I ended up spending +$1,000 on fixing it, which didn't really fix everything and had to sell it for the same exact amount (so, a $2,500 loss)..\n\nI really prefer something with a big battery and I just came across this [Super Glide 4.0](https:\/\/www.ridetheglide.ca\/products\/electric-bikes\/fat-e-bikes\/super-glide-stand-on-bike\/) which has a monster couple of batteries at a considerable price, sold, and apparently made right here in Victoria.\n\nAlthough it is being sold as an \"stand on bike\", I guess it's technically a scooter since it doesn't have any pedals. I have noticed that riding E-Scooters is not technically legal in Victoria, as we are not a part of the \"participating communities\" in the [Electric Kick Scooter Pilot Project.](https:\/\/www2.gov.bc.ca\/gov\/content\/transportation\/transportation-environment\/active-transportation\/policy-legislation\/motor-vehicle-act-pilot-projects\/scooter)\n\nGiven that I plan on mostly riding it in the bike lanes, would you think investing on this would be safe, or would I have to pay lots of fines if cops were to see me riding it?\n\nThanks!","label":0,"Predicted_Label":0}
{"text":"Anyone want a free flight from YVR>Puerto Vallarta on December 30th? I have a Flair Airlines coupon about to expire that I'm using on that flight, but could cover 1-2 more people and figured why not offer?. Long story short, I had an issue with Flair last year and got a $1200 coupon as compensation that expires at the end of the year. I'm using it to fly one way to PVR with my boyfriend (and from there we're flying to a different city then home from there), but that'll only use like half the coupon's value. AFAIK I can't spread it out on multiple purchases, and I don't have any other travel plans this year. None of my friends want to come that date, so I figured I should see if anyone else would benefit from it rather than let the extra value go to waste. Obviously, you're responsible for your own return flight since we're just doing one way, but if you're thinking of a Mexico trip, might as well save a few hundred bucks :) ","label":0,"Predicted_Label":0}
{"text":"Plans to log 109 hectares of old-growth forest adjacent to the Juan de Fuca Provincial Park. [https:\/\/www.vicnews.com\/news\/plans-to-clear-cut-old-growth-near-port-renfrew-causes-an-environmental-outcry\/](https:\/\/www.vicnews.com\/news\/plans-to-clear-cut-old-growth-near-port-renfrew-causes-an-environmental-outcry\/)\n\n&#x200B;\n\n\"the provincial government agency is proposing 2019 cutblocks across the last intact old-growth rainforest areas on Vancouver Island adding up to more than 1,300 hectares\"\n\n&#x200B;\n\n\"seven planned cutblocks, two of which come to within 37 metres of the Juan de Fuca Provincial Park boundary near Port Renfrew\"\n\n&#x200B;\n\n\"A spokesman for the Forest Ministry responded with a statement that confirmed the sale of the cutblocks, reiterated the government position that 55 per cent of old growth forests are protected and said that ending logging in old growth forests would affect people engaged in the logging industry.\"\n\n&#x200B;\n\nUpdate: If you want to let the BC NDP government know what you think about this, Ancient Forest Alliance has [a nice tool you can use](https:\/\/www.ancientforestalliance.org\/speak-up-for-old-growth-next-to-jdf-provincial-park\/?mc_cid=bb5621a1ca&mc_eid=304ef99d16).","label":1,"Predicted_Label":0}
{"text":"Light Rail launches in Kitchener-Waterloo, similar size as Victoria and smallest community in North America. I'm a recent transplant from Ontario and I know light rail transit has been discussed here before. LRT just launched this week in Kitchener-Waterloo, ON, and if they can pull it off then I can't see why it wouldn't work in Victoria. (KW is a sprawling wasteland that is much more car-dependant.)\n\n&#x200B;\n\n[https:\/\/uwaterloo.ca\/stories\/ion-light-rail-we-choo-choo-choose-you](https:\/\/uwaterloo.ca\/stories\/ion-light-rail-we-choo-choo-choose-you)\n\n[https:\/\/www.therecord.com\/news-story\/9447412-riders-celebrate-ion-s-first-day\/](https:\/\/www.therecord.com\/news-story\/9447412-riders-celebrate-ion-s-first-day\/)\n\n&#x200B;\n\nHere's some context and parallels to consider:\n\n* Kitchener-Waterloo has a combined population of \\~350k and is the smallest community in North America with LRT.\n* Their metro area (Waterloo Region) had the same population as Greater Victoria today when planning began in the early 2000s.\n* KW's LRT has already spurred billions of $ in private investment along the route, several times its cost. The corridor has rapidly densified in anticipation of the service.\n* Their system is 19km long. A similarly-sized network here could connect Downtown Victoria to the Westshore and a spur through Saanich to UVic.","label":0,"Predicted_Label":0}
{"text":"New Crystal Pool engagement session. Chance to give feedback on the detailed designs!. Got this message today and was asked to share--thought some redditors might be interested. \n\n>Greetings from the City of Victoria, \n \n>We are very pleased to inform you that the [Crystal Pool and Wellness Centre Replacement Project](http:\/\/www.victoria.ca\/EN\/main\/residents\/facilities\/crystal-pool\/crystal-pool-and-wellness-centre-replacement-project\/the-plan-1.html) is entering phase two of design refinement. The feedback that we hear from the community, along with best practices and trends in aquatic and recreation centre design, will advance the building and site design toward construction ready documents.\n \n\n>On Tuesday February 27, 2018, the City is hosting two Public Engagement Sessions at Crystal Garden, which will be led by representatives from HCMA Architecture+Design. During these sessions, attendees will be:\n\n * Provided a project update including a presentation on considerations for programming and design, as well as key outcomes of the project. \n\n * Asked to **provide input on preferred activities and priorities that will inform the future building’s design**.\n \n\n>Please [RSVP here](https:\/\/www.surveymonkey.com\/r\/KTWDSQ7) to indicate which of the two engagement sessions you would like to attend. Identical sessions are offered from 3-5 p.m. and from 6-8 p.m. to enable as many to attend as possible. You do not need to attend both sessions. \n \n\n>If you have children that are attending with you, please indicate within the RSVP. Recreation staff will be present to provide activities for children under 12 years of age.  \n \n>We look forward to seeing you at this session.\n \n>The Crystal Pool and Wellness Centre Replacement Project Team\"\n\nEdit: formatting","label":0,"Predicted_Label":0}
{"text":"What the heck is going on in Nanaimo?!. Everyday it seems there are new reports about some random assault\/killing\/police chase\/car theft etc. in Nanaimo. The cases seem quite violent and random. I read the Victoria Times Colonist and they've started to practically devote the whole third page to Nanaimo's latest crime stories. \n\nWhat do you think is behind this apparent surge in violent crime in Nanaimo? \n\nI know this is a forum about Victoria, but I wanted people's thoughts since it's in our region.","label":1,"Predicted_Label":0}
{"text":"Worst Uber Ever. ","label":0,"Predicted_Label":0}
{"text":"Just watched this awesome clip on community oriented policing out of Texas. This help reduce homelessness and crime. Anyone know if we have a program like this in Vic?. ","label":1,"Predicted_Label":0}
{"text":"Building\/Mailboxes robbed. My cousin's apartment building in Fairfield was broken into last night and the metal mailbox bank, was completely pried open and all the mail was stolen.  Perhaps for identity theft? (as cheques and credit cards now need security details for activation?) \n\nAre you aware of other buildings having this type of robbery\/damage lately?","label":0,"Predicted_Label":0}
{"text":"(I really hope this gains traction and tenants in Victoria can organize something similar)More than 300 tenants at 2 Toronto apartment buildings have stopped paying rent. ","label":1,"Predicted_Label":1}
{"text":"Why the hell is the Bay Street Wendy’s always so God damn busy?. Every time I drive by the entire parking lot is full of cars waiting for the drive thru. One time I really wanted Wendy’s and I thought I’d be smart by parking and going in, but the customers were lined up to the door inside as well (I did not get in line). Are they selling drugs????","label":0,"Predicted_Label":0}
{"text":"Saanich Council approve name change for Mount Douglas Park. ","label":0,"Predicted_Label":0}
{"text":"Fighting Fentanyl | TRAILER - we're taking you behind the scenes in our fight against this killer drug. New episodes every Tuesday & Thursday, starting Aug 29th.. ","label":0,"Predicted_Label":0}
{"text":"Emegency Generator. Anyone considering an emergency generator in Victoria to have handy should we need it. Worth the money ? I am considering a portable inverter. House generators are not just in the budget and even got quoted $2K for a transfer switch, supposedly interlocks are not to code and not allowed.\n\nWhat are people looking at or have bought recently if any ? Last thing want is to go try find one during a disaster.\n\n&#x200B;\n\nThanks","label":0,"Predicted_Label":0}
{"text":"Doctor and nurse go mobile to provide palliative care to Victoria's homeless | CBC News. ","label":1,"Predicted_Label":0}
{"text":"Greater Victoria police add heavily armoured vehicle to arsenal. Wondering if u\/VicPDCanada can shed any real light on why the police feel they need an APC for an area that doesn't seem to have much terrorist or major gang activity.  I haven't seen any massive shoot outs or major bomb attacks in the news here so why do we need a vehicle designed for combat in military areas?  What does it provide that wasn't being provided by the regular armored trucks and cars?\n\n\nhttps:\/\/www.vicnews.com\/news\/greater-victoria-police-add-heavily-armoured-vehicle-to-arsenal\/\n\n","label":1,"Predicted_Label":0}
{"text":"Do you want an AMA with Our Place Staff?. Would you like to participate or simply read a transparent reddit \"Ask me Anything\" with the volunteers and staff at Our Place  Society? \n\nI'm a volunteer with Our Place Society and I just came across the idea as a shower thought to host an Ask Me Anything with Our Place Society on this subreddit. After being an \"outsider\" to the organization and general homelessness in Victoria for a number of years and more recently meeting the awesome people who volunteer and do great work at Our Place Society, my perspective and knowledge on the current societal issues and organizational developments has changed and grown...\n\nThe idea that I'm proposing, if there is public interest, is to have a transparent QnA over Reddit with some of the leaders of Our Place Society, where anyone can simply ask them about the organization, the current developments within it, and what's happening in our beautiful city. \n\nAs an outsider to the organization and still being relatively new, I understand some of the perspectives that many people have regarding the housing crisis, opioid epidemic, and general homelessness in Victoria. For me, I only saw it through the lens of seeing Tent Cities from the double decker 50 or 61 and by bike, with time I also sourced information from coworkers and the news. But after talking to the volunteers and leaders at Our Place, as well as some nurses working for similar organizations, my perspective broadened to the point where I myself can see the lack of publicly available information regarding pressing issues and the general topic of homelessness in Victoria. \n\nSo if you're interested in having an \"Ask me Anything\" with some of the leaders and volunteers at Our Place Society, let me know in the poll and depending on the interest I may be able to convince a few of them to frequently check a formal reddit post on the topic (will also need to check with moderators about how to best organize this event). Thanks, stay safe, stay healthy folks.\n\n[View Poll](https:\/\/www.reddit.com\/poll\/k030ge)","label":1,"Predicted_Label":0}
{"text":"Looking for property management companies or real estate agencies recommendations. Hi everyone!\n\nThere is a chance my husband and I will relocate to Victoria at the end of the year, and we will be looking for a rental soon.\n\nAre there any property management companies or real estate agencies you would recommend?\n\nI'm tired of using Craigslist and similar platforms. We once ended up in a house with faulty wiring, and honestly, I'd prefer to go with a reputable company this time.","label":1,"Predicted_Label":0}
{"text":"Off-Duty Officer Attacked While Volunteering. https:\/\/vicpd.ca\/2021\/09\/14\/off-duty-officer-attacked-while-volunteering\/\n\nDate: Tuesday, September 14, 2021\n\nFile: 21-37515\n\nVictoria, BC – An off-duty VicPD officer suffered non-life-threatening injuries after she was attacked while volunteering in Victoria yesterday.\n\nAt approximately 12:30 p.m. yesterday afternoon an off-duty VicPD officer was volunteering her time to walk a dog in the 500-block of David Street when she was randomly approached by an unknown woman. The woman was agitated and acting erratically, and accused the officer of stealing the dog she was walking. The woman then physically attacked the off-duty officer. A struggle ensued that went to the ground and the suspect struck the officer several times, including violently kicking the officer several times while she was on the ground. The suspect then fled the area.\n\nThe officer did not require medical treatment at the scene. She was off-duty and recovering from a life-altering injury sustained nearly two years ago after being assaulted by a suspect during a different police incident.\n\nPatrol officers responded to the incident and located the suspect a short distance away from the scene. Officers arrested the suspect without further incident.\n\nThe suspect was transported to VicPD cells where she was later released with a court date and conditions. She will face recommended charges of assault.\n\nIn British Columbia, the decision to release a person is based on the likelihood they will attend court, the risk posed to public safety, and the impact on confidence in the criminal justice system.  In addition, Bill C-75, which came into effect nationally in 2019, has legislated a “principle of restraint” that requires police to release an accused person at the earliest possible opportunity after considering these factors. This is founded in the Canadian Charter of Rights and Freedoms that every person has the right to liberty and the presumption of innocence pre-trial.  Police are also asked to consider the circumstances of Indigenous or vulnerable person in the process, in order to address the disproportionate impacts that the criminal justice system has on these populations.\n\nThis file remains under investigation.\n\nIf you have information about this incident, please call our non-emergency line at (250) 995-7654. To report what you know anonymously, please call Greater Victoria Crime Stoppers at 1-800-222-8477.","label":1,"Predicted_Label":0}
{"text":"School Trustee Recommendations. There's a ton of people running for school trustee, and it takes a long time to look up 25+ people, read their websites, twitter pages, cross reference them against any other drama that's gone down (and boy, has there been a bunch...), and look up other groups endorsements. I know this because I spent several hours doing this yesterday. \n\nI don't want to endorse a specific slate or group of candidates, so here's my long-list of my preferred \"left leaning\" candidates, listed in alphabetical order, with brief summaries of who endorsed them, any applicable work history\/school involvement I was able to find, and anything that stood out on their websites aside from usual stuff about supporting students\/etc.\n\nSome general notes:\n\n* all candidates support SOGI\n* as most of the candidates running are in the 50+ demographic, I have noted if any of them currently have children in school or are under 40, aka \"young\"\n* GVTA = Greater Victoria Teacher's Association\n* PAC = parent advisory council, each school has one\n* Just because I don't mention something specifically doesn't mean the candidates don't value it (ie, covid safety) but if a candidate seemed particularly focused on something that other candidates were not (ie, music education) that is noted\n* In the past term there has been a lot of controversy around selling school district land to make the budget work, appropriate use of school district land, cuts to the music program, and the very odd suspension of two trustees, Diane McNally and Robert Paynter. The school board was ordered to re-instate both these candidates. It was impossible for me to figure out exactly what happened without spending several more hours on research, but please note that BC courts decided the suspension was without merit and many groups that work with the school board were upset and troubled by it\n* Voters need to pick 9 trustees for school district 61, there are more than 9 here, I think they would all do a good job, please read up on them yourselves to make a final selection\n\n**Natalie Baillaut**  \n\n\n* teacher on call, young, endorsed by GVTA\n\n**Angela Carmichael**  \n\n\n* spearheaded renaming George Jay elementary, vocal critic of previous school board drama, previous chair of Victoria Confederation of Parent Advisory Councils, former PAC member, endorsed by GVTA\n\n**Sacha Christensen**  \n\n\n* works for Randall Garrison's office, endorsed by Andrew Weaver, running specifically to bring younger voices to the board, young\n\n**Mavis E David**  \n\n\n* endorsed by GVTA, extensive work history as youth care worker, education program supervisor and youth care worker, BA of child care from UVIC\n\n**Nicole Duncan**  \n\n\n* endorsed by GVTA, former green party candidate, was on her PAC, former trustee\n\n**Derek Gagnon**  \n\n\n* endorsed by GVTA, lots of volunteer experience with cadets, concerned with transparency and accountability of school board\n\n**Daphna Gelbart**  \n\n\n* strong focus on covid safety, has young children in school\n\n**Karin Kwan**  \n\n\n* endorsed by GVTA, vocal supporter of music in schools, helped raise money to keep the elementary strings program going for another year\n\n**Emily Mahbobi**  \n\n\n* endorsed by GVTA, young, member of the arts scene\n\n**Diane McNally**  \n\n\n* endorsed by GVTA, was one of the trustees suspended by the previous board\n\n**Kyle McStravick**  \n\n\n* mentions COVID 19 safety, strong advocate for music, urban planner, seems to have the strongest concern about the sale of school district land to balance budgets in as much as that he feels a proper transparent policy needs to be in place guiding these decisions, young\n\n**Robert Paynter**  \n\n\n* endorsed by GVTA, was one of the trustees suspended by the previous board\n\n**Sources:**  \n[https:\/\/www.sd61.bc.ca\/wp-content\/uploads\/sites\/91\/2022\/09\/School-Trustee-Candidate-Profile-Guide-2022-FINAL.pdf](https:\/\/www.sd61.bc.ca\/wp-content\/uploads\/sites\/91\/2022\/09\/School-Trustee-Candidate-Profile-Guide-2022-FINAL.pdf)  \n[https:\/\/www.vcpac.ca\/trustee-election\/index.html](https:\/\/www.vcpac.ca\/trustee-election\/index.html)  \nAnd of course, our friend Google.","label":0,"Predicted_Label":0}
{"text":"Greater Victoria home sales dip as inventory dries up, prices rise. ","label":1,"Predicted_Label":1}
{"text":"Victoria Harbour Ferries shutting down June 30th in disagreement with the Greater Victoria Harbour Authority. ","label":0,"Predicted_Label":0}
{"text":"New Vancouver Island Org Bringing Candidates With Far-Right Politics To School Board Elections. ","label":0,"Predicted_Label":0}
{"text":"Victoria Council just approved the Harris Green development. Hey all, I know this was getting a lot of attention with a lot of people worried about the future of all that rental housing. Just minutes ago, council voted 8-1 to approve the development permit, accepting the developer's push back on a few items. Overall seems like some great compromise, the building is greener than originally proposed, but not as much as council had hoped.\n\n1500+ units of rental housing on the way, let's gooooo!","label":1,"Predicted_Label":1}
{"text":"1 year ago today Duckanamania swept r\/VictoriaBC and some other parts of BC. 🦆🍌. ","label":0,"Predicted_Label":0}
{"text":"The Rise of Coworking Spaces in Victoria - A New Way of Building Community — Sidewalking Victoria. ","label":1,"Predicted_Label":0}
{"text":"Private Doctors?. I'm looking for a private doctor. I have amazing insurance with my work. I want to renew my prescription without having to wait 2 to 3 hours at a walk-in clinic. Is there any private clinics in Victoria? Would it be easier in Vancouver? I'm willing to fly to Vancouver just to NOT go in a walk-in clinic.\n\nEDIT; My med cannot be prescribed online, it's against the law in BC.","label":0,"Predicted_Label":0}
{"text":"Best dumplings in town ? Make at home or go out-. Looking for the best dumplings to go out or make at home.   Thanks","label":0,"Predicted_Label":0}
{"text":"Mortgage broker or bank who will finance manufactured home on rental pad?. UPDATE: We went with RBC. Tried Mortgage Designers, they weren't able to do it, but they gave me more recommendations. TD never phoned me back. \n\nHey folks. My partner and I are looking at buying a manufactured home on a rental pad. I've been told that not all banks and mortgage brokers will finance these as you don't own the land under your house. \nHas anyone financed a place like this and would you recommend who you used? Our bank has a flat interest rate of 6.6% for a place like this and we're hoping to find something better.","label":1,"Predicted_Label":0}
{"text":"Richmond Road's Turner Building, former home of Ian's Coffee Shop, part of new redevelopment play. ","label":0,"Predicted_Label":0}
{"text":"Young family left homeless in hot housing market. ","label":1,"Predicted_Label":1}
{"text":"BC Ferries ship damaged in high winds out of service for at least a week. ","label":0,"Predicted_Label":0}
{"text":"Who’s behind the influx of pro-life stuff around town this week?. Friends got some graphic flyers in the mail and there were some equally graphic posters and protesters on the side of Blanshard near uptown yesterday. Not used to seeing them out in the wild here.\n\nEdit: looks like Canadian Center for Bioethical Reform was in town this week for a cross canada tour. Call non emerg (Saanich 250-475-4321) (Victoria 250-995-7654) and cops will be dispatched to tell them to move along. \n\n\nAlso some highlights from the comments:\n\n“It's actually against the law to display pictures like that. You are within your rights to call the police to have them disbanded.\n\nObscene materials\n\n163 (1) Every person commits an offence who makes, prints, publishes, distributes, circulates or has in their possession for the purpose of publication, distribution or circulation any obscene written matter, picture, model, phonograph record or any other obscene thing.\n\nMarginal note:Idem\n\n(2) Every person commits an offence who knowingly, without lawful justification or excuse,\n\n(a) sells, exposes to public view or has in their possession for that purpose any obscene written matter, picture, model, phonograph record or any other obscene thing; or\n\n(b) publicly exhibits a disgusting object or an indecent show.”\n\n\nAnd\n\n10-metre fixed buffer zone around a doctor's office, 50 metre fixed buffer zone around a hospital or clinic (they've been within the buffer near the ultrasound clinic at uptown), and 160-metre fixed buffer zone around an abortion provider or clinic worker's home. The Access to Abortion Services Act, enacted in 1995, refers to this area as an \"access zone\".\n\nhttps:\/\/www.bclaws.gov.bc.ca\/civix\/document\/id\/complete\/statreg\/96001_01","label":0,"Predicted_Label":0}
{"text":"Let's not forget this election result. [1,107 people voted for Douglas Stewart and his anti-immigration screed](http:\/\/www.election2014.civicinfo.bc.ca\/2014\/reports\/Results.asp?localgovernmentid=142) of 24,665 total votes cast.\n\nThat's right around 4.5% of downtown voters wanting a municipal councillor to do something [about our immigration policies](http:\/\/www.victoria.ca\/assets\/Departments\/Legislative~Services\/Douglas%20Stewart%20Candidate%20Profile%202014.pdf). Just something to keep in mind next time you wonder how tolerant Victoria is of other cultures.","label":0,"Predicted_Label":0}
{"text":"I need to plot my property line. Can r\/victoriabc recommend a land surveyor?. Good afternoon \/r\/VictoriaBC.  As the title states, due to a bully neighbor, I need to have my exact property line defined and staked out. I have called city hall, and was told the dimensions of my lot. The original white property stakes are long gone, and cannot locate the metal pins usually placed in ground.  I will be going to city hall on Monday to hopefully find the conveyance, but have a feeling I may need to hire a land surveyor. I called one and the rates start at around $1000.00. \n\nCan anyone recommend a surveyor? Is the standard rate for such services?\n\nThank you in advance.","label":1,"Predicted_Label":0}
{"text":"You can affect housing change. I see a lot of posts and people that are very critical of the current state of housing in Victoria. I just want to remind everyone that City Councils are basically all powerful on housing change in Victoria and the surrounding municipalities. For more housing to be built, single-family lots need to be rezoned to allow more units and for any rezoning, they require years of consultation and approvals. 65% of Victoria is zoned for single family homes, and it's way higher for Oak Bay and Saanich. There is no housing growth without these being upzoned and allowing walkups, townhouses, etc. Demand is steadily increasing while supply stays the same. \n\nIf you are upset about the lack of housing being built\/allowed to be built, please email letters to mayor and council in all municipalities that are lacking on housing. They do read these emails and this is currently the best way to affect change by letting them know the number of people upset with the policies. I have linked all of the emails below. \n\nVictoria:\n\n[https:\/\/www.victoria.ca\/EN\/main\/city\/mayor-council-committees\/contact-mayor-council.html#:\\~:text=If%20you%20would%20like%20to,email%20mayorandcouncil%40victoria.ca](https:\/\/www.victoria.ca\/EN\/main\/city\/mayor-council-committees\/contact-mayor-council.html#:~:text=If%20you%20would%20like%20to,email%20mayorandcouncil%40victoria.ca).\n\n [mayorandcouncil@victoria.ca](mailto:mayorandcouncil@victoria.ca)  [malto@victoria.ca](mailto:malto@victoria.ca)  [stephen.andrew@victoria.ca](mailto:stephen.andrew@victoria.ca)  [sdubow@victoria.ca](mailto:sdubow@victoria.ca)  [bisitt@victoria.ca](mailto:bisitt@victoria.ca)   [jloveday@victoria.ca](mailto:jloveday@victoria.ca)  [spotts@victoria.ca](mailto:spotts@victoria.ca)  [cthornton-joe@victoria.ca](mailto:%63%74%68%6F%72%6E%74%6F%6E%2D%6A%6F%65%40%76%69%63%74%6F%72%69%61%2E%63%61)  [gyoung@victoria.ca](mailto:gyoung@victoria.ca) \n\nOak Bay:\n\n[https:\/\/www.oakbay.ca\/municipal-hall\/mayor-council\/council-profiles](https:\/\/www.oakbay.ca\/municipal-hall\/mayor-council\/council-profiles)  \n[mayor@oakbay.ca](mailto:mayor@oakbay.ca); [aappleton@oakbay.ca](mailto:aappleton@oakbay.ca); [hbraithwaite@oakbay.ca](mailto:hbraithwaite@oakbay.ca) [cgreen@oakbay.ca](mailto:cgreen@oakbay.ca)  [tney@oakbay.ca](mailto:tney@oakbay.ca)  [epaterson@oakbay.ca](mailto:epaterson@oakbay.ca) [ezhelka@oakbay.ca](mailto:ezhelka@oakbay.ca) \n\nSaanich:\n\n [https:\/\/www.saanich.ca\/EN\/main\/local-government\/mayor-council\/meet-your-council.html](https:\/\/www.saanich.ca\/EN\/main\/local-government\/mayor-council\/meet-your-council.html)\n\n [mayor@saanich.ca](mailto:mayor@saanich.ca)  [susan.brice@saanich.ca](mailto:susan.brice@saanich.ca)  [judy.brownoff@saanich.ca](mailto:judy.brownoff@saanich.ca)  [nathalie.chambers@saanich.ca](mailto:nathalie.chambers@saanich.ca)   [zac.devries@saanich.ca](mailto:zac.devries@saanich.ca)  [karen.harper@saanich.ca](mailto:karen.harper@saanich.ca)  [rebecca.mersereau@saanich.ca](mailto:rebecca.mersereau@saanich.ca)  [colin.plant@saanich.ca](mailto:colin.plant@saanich.ca)  [ned.taylor@saanich.ca](mailto:ned.taylor@saanich.ca)","label":1,"Predicted_Label":1}
{"text":"Housing solved!. ","label":1,"Predicted_Label":1}
{"text":"Oak Bay Mayor Kevin Murdoch insisted capacity, rather than political will, is the reason Oak Bay has a low number of housing starts. Thought this was worth a laugh. By 'low' we can only assume he actually means 'no' housing starts.","label":1,"Predicted_Label":1}
{"text":"Jim's Travel Playlist. My dad was recently diagnosed with a terminal brain disease and has 7-9 months to live. He loves to travel and loves music, so I decided to work on a project that combines those two passions. I’m asking people who live in some of his favorite places to take a short video in those spots and play one of his favorite songs on a speaker, off a phone, or I can add the song in later. It can also be just the first few seconds of the song. The video can just be “Hello, I’m (name) and I’m at (place) and I’m playing (song) for Jim.”\n\nHis first (barely) out of the country travel experience was a trip to Victoria, BC. He still talks about how lovely Victoria was and I would love to have someone from Victoria film a bit for the project. I've attached a sample of the project to give you an idea of what it looks like.\n\nPlease let me know if you'd be able to help out!\n\n[https:\/\/drive.google.com\/file\/d\/1pWkPV-Fb3eR-wMUSe1xVGorKFwMFA\\_QG\/view?usp=sharing](https:\/\/drive.google.com\/file\/d\/1pWkPV-Fb3eR-wMUSe1xVGorKFwMFA_QG\/view?usp=sharing)","label":0,"Predicted_Label":0}
{"text":"Anyone living in Victoria and working (semi-remotely) in Seattle?. Hi everyone. In short, I landed a great tech job in Seattle, but for personal family reasons we are thinking about maybe moving across the border in 2-3 years. The obvious options would be either Vancouver or Victoria. I used to live in Vancouver and loved it, but now I have a family and I think we would prefer a small city like Victoria.\n\nThe company I'll be working for is pretty open to semi-remote work, where I would spend maybe e.g. two says per week in Seattle, and work the rest of the week remotely.\n\nAnyhow, I am just curious if anyone who maybe has a similar setup could share their experience wrt how feasible this would be. Thanks!","label":1,"Predicted_Label":0}
{"text":"So... trying to move to Victoria. The city seems so wonderful. I'm living in Winnipeg (I have all my life) and I can't take this cold anymore. I'm at a point in my career where I've got a bit of experience under my belt and I finally started last week to apply for pretty much anything I qualify for and would be able to afford a decent condo.\n\nSo, that being said... how is your community? What do YOU find attractive about the city? What are the pitfalls in your eyes? Would I be culture-shocked living there vs visiting?\n\nFeel free to throw in any other thoughts as well!","label":1,"Predicted_Label":1}
{"text":"Employment situation in Victoria?. Hello all, \n\nI'm a 24 year old Nanaimoite and have been away from B.C. for several years, though I think I want to return to the Island in search of long-term work. I was wondering how the employment situation in Victoria seems, given that it has one of the lowest unemployment levels in Canada?\n\nI have a University degree and 2 years of experience in education, though not as a teacher, so I think I would be aiming for public sector if possible. \n\nWould I likely be able to find a fitting job? I'm getting a bit too old to live with roommates. ","label":0,"Predicted_Label":1}
{"text":"Amid Covid outbreaks, violence and anti masking, Our Places closes doors for one day. Note the comments about Covid outbreaks at Paul's Motor Inn, Comfort Inn and Our Place - I have heard about this from a few sources now.\n\n[https:\/\/www.vicnews.com\/news\/our-place-society-in-victoria-sends-strong-message-by-closing-drop-in-centre-for-a-day\/](https:\/\/www.vicnews.com\/news\/our-place-society-in-victoria-sends-strong-message-by-closing-drop-in-centre-for-a-day\/)","label":0,"Predicted_Label":0}
{"text":"Is this fair? Sneaky landlord. We’ve been renting our condo for the last 3 years. The owners of our condo have used a property management company as a liaison between us (tenants) and the landlords (owners). \nAbout 3 weeks ago we received a call saying that the landlords would like to move back into the condo we are living in because they had sold their house. This meant we had to find a new place to live. We acted quickly and signed a lease for a new space which is $350 more per month. We began planning our move which included hiring movers, packing up most of our things, hiring a carpet cleaner for the apartment we’re moving out of as per the tenancy agreement, etc. We emailed our intended move out date to the property management company. Today, 1 week out from the move, we get a call from the property management company saying that the owners no longer want to move back in because they got a great deal on another condo and that we can stay. They did this knowing we already signed another lease and provided our move out date. It seems like they had a plan all along to get us out so they could up the rent prices… we’re not sure what to do. Also we found out from others in the building the owners got this condo for a great deal because they had a sob story about how they were disabled and needed it for accessibility reasons then never even lived here and immediately began renting it out. It’s all very shady and seems unfair and like a big shitty loophole. We definitely intend to seek legal advice next week, we were just hoping someone in here may have advice in the meantime.\n\nEdit: Yea we were given a formal notice via email right after the phone call I received 3 weeks ago.\n\nEdit: Really appreciate all the advice on this. It’s been a stressful few weeks dealing with this and we had no idea what to do. Thanks again for the advice!","label":1,"Predicted_Label":1}
{"text":"So... 60 years old and finally barred!. Look at me go. I was enjoying a beverage with my wife at the Monkey Tree pub. We support local! Three guys sat down, two of them went to the bathroom without masks. I told our waitress who went over and they laughed with her as they received the message. Then it happened again with them. Twice. Stink eye happened.  The “manager” came over and said “back off”. Couldn’t believe it. Went to pay the tab at the counter and wanted to speak to that “manager”. That guy sent some other guy to the counter who said that they are protocol perfect and to pay the bill and “never come back”. Barred from the Monkey Tree Pub! For observing Public Health protocols! We went there solely to support local business.  So I did. And I promise I will never ever appear any where near your nasty little place again.","label":0,"Predicted_Label":0}
{"text":"Need help with a mental health issue. Hey all, thanks for reading. I don't know where else to turn at this point. Sorry for the wall of text. \n\nMy aunt has tried to kill herself. The first time was May 2013. It came as a shock to our family. \n\nShe is in her 50's, but due to lack of oxygen at birth she was developmentally delayed. I don't know how best to describe her. She can function as an adult in some ways, but in others she is like a child. She has tantrums like a toddler at times, and has poor ability to grasp consequences. She has a lot of trouble expressing herself. She has always lived with my grandmother, who is now in her late 80's and is in denial about the situation with her daughter. \n\nA month or so ago, my aunt tried to kill herself again. Both times were by taking pills. We told grandma that all pills have to be kept from my aunt, but my grandma seems to think that my aunt is just behaving like a bratty child. She can't seem to grasp the seriousness and isn't making much of an effort to keep the drugs secured. \n\nThe first overdose was worse than the second. It really messed up her body. She was in hospital for several days, and then was sent home. Since then, she has had tinnitus (or something similar) that is causing her to basically lose her mind. She goes to the emergency room every week or two. She sees her family doctor or clinic doctors on a weekly basis. They keep *fucking* prescribing pills!!! All she wants is for the noises in her head to go away. There is nothing medically wrong with her that can be detected at this point (she has had all sorts of tests, MRIs, etc). \n\nAfter the attempt last month, she told us she wants to go into a care facility. The problem is that she doesn't qualify for one. After the first OD she was clearly in a major state of depression. She wouldn't talk to anyone anymore. After the second attempt, things seemed better. I thought maybe it is because she thought she would get the help she wants\/needs, but now I'm not so sure. I worry that she has made up her mind to die, and that is what is making her feel better. \n\nI just found out that she tried to drink chemicals a few days ago, but my grandma stopped her. \n\nWe are at a loss. She can't talk to counsellors because she doesn't understand that they're not there to help with the tinnitus. She just babbles about her head. We truly believe that she will keep trying to kill herself until she succeeds. We don't know how to keep her safe. \n\nDoes anyone have any suggestions? Can we have her committed? Hospital staff seem completely unwilling to do anything other than prescribe pills and send her home. We are desperate to help her. I've posted enough info here for my friends\/acquaintances to recognize me, but I don't know where else to turn. \n\nThank you. ","label":0,"Predicted_Label":0}
{"text":"Victoria's municipal election. Are there any upcoming all-candidates meetings\/debates for Victoria's mayoral\/council race? How are people figuring out who to vote for?","label":0,"Predicted_Label":0}
{"text":"Maker\/Hackerspaces in Victoria?. Are there any makerespaces or hackerspaces in the greater Victoria area? I have this project, but no space and minimal resources. Thanks!","label":0,"Predicted_Label":0}
{"text":"Transitioning from an office job to trades?. I'm currently 25 and after a couple years working in government I think I've decided that an office job isn't for me. Wondering what people's experiences are like transitioning from an office job to the trades in Victoria\/the island? \n\nI'm looking at electrical\/plumbing\/hvac as those seem to be commonly recommended. However after a bit of research it seems Victoria is somewhat oversaturated with electrical apprentices. I'm happy to do hard work, but ideally I'd be interested in something with relatively minimal wear and tear on the body.","label":0,"Predicted_Label":0}
{"text":"Beautiful Day Guy. When I lived on Shelbourne between hillside and bay st back in around 2003 there was a guy that always wandered around and I only knew him as \"beautiful day guy\". Whenever I encountered him he would always greet me with \"Oh, it's a beautiful day today!\" then he would start taking about the weather and how the weather people would go in the back room to smoke weed then tell the weather. \n\nDoes anyone else remember this guy? I never knew his name. I think of him from time to time, he made a lasting impression on me as he was always so positive and brightened my day. I always wonder what happened to him and I look out for him every time I go through that neighborhood.","label":0,"Predicted_Label":0}
{"text":"Drivers treating pedestrians like….. This is the second time this week that I have been honked at, and gestured at, to walk faster at a pedestrian lit crosswalk, while a driver wants to make a turn. While it’s my right of way. And I walk fast, too. I can’t tell you how many times this has happened in a whole. \n\nI have to cross though a roundabout daily, where there’s pedestrian crosswalks but it’s not lit. I sit there for minutes watching car by car drive by not stopping. It’s ridiculous... \n\nPeople making turns while I’m crossing the street just BARELY missing me, not okay. \n\nThere is no reason important enough to drive like an ahole and hit someone. \n\nPlease be respectful of everybody on the road, drivers AND pedestrians.\n\nSaying this I do recognize that there are less than favourable pedestrians here as well. My point is it is a lot safer for everyone if we stay aware and respectful of everyone both drivers and pedestrians","label":0,"Predicted_Label":0}
{"text":"Warning to cat owners in the saanichton peninsula-. There seems to be someone going around and killing cats down by Mt. Newton\/Lochside area. I hate having to make this post as I know animal abuse can be really upsetting to people but I feel the need to warn others.\n\nI know 5 people thus far, 1 of which being family, who have had their indoor\/outdoor cats murdered in nefarious ways by an unknown person. We have found multiple bodies, and I don’t want to go into too much detail because the whole thing is literally making me sick to my stomach…I’ve been puking on and off for weeks since finding out. There’s also been an uptick in missing cat posters which I feel could be related given the bodies we’ve found.\n\nAlso *please* don’t turn this post into a debate about why people shouldn’t let their cats outdoors. I fully agree that it’s dangerous for the cats, bad for the ecosystem\/small bird population, etc. \n\nThis is strictly supposed to be a PSA to cat owners within the area that let their kitties outdoors. \n\nSomething similar was going on in the keating area about a decade ago and then it seemed to stop so I had just assumed the person responsible moved locations. \n\nNot trying to scare people, just want to warn others and try to inform cat owners in the saanichton area. I debated even making this post but feel like it’d weigh at my conscience if I didn’t, people need to know.\n\nEdit- Hi everyone,\n\nSorry I made this post before having a large family gathering for the holidays so I’m only now having a chance to sit down and read everyone’s comments.\n\nThere’s alot so I’m sorry if I’m not able to answer everyone’s questions!\n\nWe have made reports to the police but other than making a file- unfortunately there’s not much else they can do (for now).\n\nWill be reporting to the SPCA tomorrow, have already reported to a couple other locals cat rescues\/organizations.\n\nYes predatory animals exist and I acknowledge it’s a possibility, quite a few people mentioned this and this could (potentially) be the case for a couple of the dead cats. But one cat was shot with pellets and the another was drowned in a sack. So there’s a possibility it could be a mixture of both? Either way I just wanted to warn people so that they could bring their cats inside if possible.\n\nI appreciate everyone taking the time to comment. I do have to get to bed asap cause I gotta be up early in the AM but I’ll try to answer any other questions that stood out at some point tomorrow.","label":0,"Predicted_Label":0}
{"text":"Have really poor eyesight \/80% coverage. Hello. My recent eye exam reads -7.25 and -6.25. The current pair of glasses I wear have a metal frame. I choose this style as there is a gentleman on Burnside that  can (and has twice) repaired my broken frames. (cost effective and fast)  However the frames are quite thin and my lenses (with every option available ) are still quite thick. Where would you recommend I go please? Thank you!","label":0,"Predicted_Label":0}
{"text":"Is prima Strada the best 'that' style pizza?. 10 years ago it was without a doubt the best pizza in town in my opinion. Now, I'm not so sure. Ever since the fungi changed it hasn't been the same. Does anyone have any suggestions that can beat the prima strada of old?\n\nUpdate: Pizza quest 2023. We (3 of us) did an experiment! We tried a mushroom pizza from 900 degrees, standard pizza and prima Strada. All on the same day within a window of 3 hours. We ate a slice immediately at each place, then saved a slice for a reheated side by side at home the next day.\n\n1st) Prima strada - two of three thought it was best. I cant express how close it was. Pros: mushroom variety, great overall crust, herb flavor, good cheese ratios. Con: price, poor topping distribution, a lot of edge crust to pizza ratio\n\n2nd) Standard Pizza -  This was my favorite and the other two second favorite. Pros: Nice and cheesy, best mushroom flavor, crust to pizza ratio(less edge crust), value. Con: too cheesy!? (For the other two).\n\n3rd) 900 degrees - not even close sadly. Thier take on mushroom pizza is very different. Resounding 3rd for all.","label":0,"Predicted_Label":0}
{"text":"Crowds headed up Johnson then turned south on Douglas, probably headed down to the legislature. ","label":0,"Predicted_Label":0}
{"text":"Financial Advisor Recommendations?. Hi everyone!\n\nRecently I started working my first \"real\" job after university with a significant salary. I have some extra cash to set aside, but I am young and in no way financially literate. I grew up in a very poor home and literally have no idea what to do with money that you don't have to spend. I was hoping to speak with some sort of financial advisor because I want to make smart decisions that will benefit my future, and I was wondering if anyone had recommendations for someone reputable and trustworthy. It should be noted that I am not talking about millions of dollars here, so I don't need anything crazy, but rather someone with experience who can teach me how to use my money wisely and safely. I would also love to not have to spend thousands and thousands for exposure to their advice.\n\nThanks in advance!","label":0,"Predicted_Label":0}
{"text":"Looking for food service mentors. I'm hoping to start a food service business and looking for some mentors. My ideal set up would be a permanent space with a walk up take out window. I don't want to open a restaurant. I moved to Victoria just before covid so unfortunately still don't know the city that well. Can you name some businesses with that set up I could reach out to? I'm also interested in speaking with people who run food trucks, food carts, or small scale home - based catering (like selling dishes through fb, etc.) I don't have a lot of connections here and am just at the very beginning of this journey. Thanks for your help!","label":0,"Predicted_Label":0}
{"text":"What are your Victoria \"Hacks\"?. What are your secret routes\/tricks\/spots for the city?\n\nBased on [this post](http:\/\/www.reddit.com\/r\/vancouver\/comments\/ng3ut\/what_are_your_vancouver_hacks\/) over at big brother r\/Vancouver\n\nMy Bad Examples:\n\n* Vancouver st is the best way to get up into Saanich if you are on bike. This is where the hill is most manageable, and it's very safe to ride on. Quadra and Cook on either side are horrible for biking on.\n\n* For unlimited free chocolate, go to the rogers chocolate factor at 4253 Commerce Circle and browse their chocolate dumpster. It is now locked at night, but come during the day and be inconspicuous for your lifetime supply.\n\n\n* Victoria abandoned sites from [Urban Exploration Network](http:\/\/www.uer.ca\/locations\/newlist.asp?n=1&statfilter=160&country=Canada&province=British%20Columbia&city=Victoria) (I think you have to be a member to unlock more galleries)\n\n\n\n","label":0,"Predicted_Label":0}
{"text":"What are your favourite thrift shops?. I have some free time tomorrow and wanted to go check out the thrift stores here. I saw a post that the Salvation Army on Hillside and Quadra had bedbugs, so I may stay away from there but maybe the other locations don’t have the same issue? Any other suggestions are appreciated!","label":1,"Predicted_Label":0}
{"text":"Multi Day Trips on Vancouver Island - Fly Fishing\/Bushcraft. I like to fly fish and camp around the Sooke area and was wondering if there were any keeners out there who would be into making shelters and grilling trout. ","label":0,"Predicted_Label":0}
{"text":"Multi Family Home Question. Hey! I'm looking to move to Victoria\/Langford\/Sooke area in the next year with my brother's family, parents, and my family - 3 family units. We're looking to combine funds and buy a multi family home.\n\nWe all want separate units, so I have a question. Could we build a garden cottage if the main house that we buy (single family zoned) has two \"units\" in it (main level and walkout basement)? I've read about secondary units, and how you can't build a cottage if you have a secondary unit, but would the walkout basement count? Does it count if family members are living in the basement vs. renters?","label":1,"Predicted_Label":1}
{"text":"Recommendations for house inspectors?. *Update: Many thanks for the suggestions and info, we've booked an appointment for an inspection. In hopes that it might help someone else, I'll update this post with the outcome and our experience with them.*\n\nHey there,\n\nWe're looking at buying a house in Sooke, and I've been researching as much as possible for reliable house inspectors. I've had a couple referrals from friends who had good experiences, but I was pretty surprised at how few reviews had been written on local companies. I'd like to hear input from anyone else who's had experience with local inspectors.\n\nAny suggestions (whether to use them or to stay far away) would be greatly appreciated.","label":0,"Predicted_Label":0}
{"text":"Bike stolen outside Denny's at Mayfair. As the title says.\nIt is a large copper MEC Chinook, now missing front wheel. The rear wheel has (had?) a rainbow LED on the back wheel. A MonkeyLectric M204R if anyone happens to recognize it.\n\nFeel free to PM me with any information, as I need this bike to get to work, but I can't afford a new one.\nIf anyone can find the bike itself, I will do my best to offer a reward, but money is very tight for me right now.\n\nSome images:\n\nhttps:\/\/i.imgur.com\/stHZHUO.jpg\n\nhttps:\/\/i.imgur.com\/i7AbBm7.jpg","label":0,"Predicted_Label":0}
{"text":"STOLEN MOUNTAIN BIKE Trek Lush SL 29 size XS. ","label":0,"Predicted_Label":0}
{"text":"Motorcycle stolen right out of driveway. [Stolen Cafe-racer style motorcycle](http:\/\/imgur.com\/a\/VrlnH)\n\n~~My good friend's bike was taken last night, right out of his driveway near Elk Lake. It's reasonably unique looking, so if you happen to see this bike around, please notify Saanich PD, as they have a file open.~~\n\n\n**Bike was recovered by Saanich PD and is back home with it's owner! Thank you all very much for your assistance. This is a great community.** ","label":0,"Predicted_Label":0}
{"text":"Investigators have released a photo of the second longboard stolen in that playground robbery that left a youth with potentially life-threatening injuries last week. Officers were called to the playground in the 3100-block of Alder Street just before 9 p.m. on Tuesday, May 1st where they discovered the victim nearby. The victim, a male youth, reported that he and a friend were in the playground when two other males unknown to them approached and took their longboards. When the victim approached the two males who had taken their longboards, he was assaulted with a weapon. \n \nThe unprovoked assault left the male youth with non-life-threatening, but potentially life-altering injuries. He remains in treatment for his injuries. The two other males then left the scene with the stolen longboards.\n \nThe suspects are described as two Aboriginal male youths, approximately 15 and 16 years old. Both were described as being short, standing about 5’3” tall and of average build. One of the suspects was wearing a red hat at the time of the incident. Our investigators continue to search for these suspects.\n\nA photograph of the second longboard that was taken by the suspects was released today. This longboard is described as an arrow-head shaped board, with a wood-grain patina. The board has hand-written lettering near the front wheels on top and a distinctive “49” sticker on the wheels near the bottom. The board also had thick yellow wheels. A photograph of the board is below.\n\nhttps:\/\/pbs.twimg.com\/media\/Dc3YVBGU0AA7L7M.jpg\n \nHave you seen this longboard?\n \nThe other longboard stolen is also distinctive. It is described as being a full-sized board, with dark grey grip tape on top with a circular black and white sticker in the middle. The underside is described as dark blue, white, grey and aquamarine pattern, with a smaller black circular sticker. This longboard is brand new. A photograph of the top and bottom of the longboard is below.\n \nhttps:\/\/pbs.twimg.com\/media\/Dc38ujTV4AE4_ep.jpg\n \nHave you seen this longboard?\n\n \nThis file remains under investigation and we will continue to release further details as we have them.\n \nAdditionally, witnesses report that a man offered assistance to the victim as he lay on the ground. This man did not remain on scene to speak with investigators and officers need to speak with him. We have not yet located this man and are asking this man to contact our investigators as he may have information about the suspects.\n \nIf you have any information about this incident, recognize either of these longboards, or believe you may know the suspects’ identities, please call our non-emergency line at (250) 995-7654. To report what you know anonymously, please call Greater Victoria Crime Stoppers at 1(800) 222-8477. \n\n\/u\/osoko here.\n\nEDIT: Changed the links to the longboard photos after redditors faced 404s.\n\n\n","label":0,"Predicted_Label":0}
{"text":"TFORCE Delivery. So this TFORCE Logistics organization that does final delivery for DHL has blatantly stolen a parcel from me.  From their Google reviews in Victoria it sounds incredibly frequent.  If I watched the driver deliver one package instead of the two he claimed can I file a theft report? After looking at their reviews it sounds like it could almost be a class action based on ongoing theft of parcels.  Forgive the rant, I just can’t afford being stolen from.","label":0,"Predicted_Label":0}
{"text":"Thetis car park. Hi everyone, is it ok to leave my car in the Thetis lake car park overnight?  \n\nWill it get towed?","label":0,"Predicted_Label":0}
{"text":"‘Hitting a wall’: Victoria doctor fed up after B.C. fails to pay her for an entire month. ","label":0,"Predicted_Label":0}
{"text":"B.C. selling less legal cannabis than any province other than P.E.I. - Victoria News. ","label":0,"Predicted_Label":0}
{"text":"Starlights adjusted proposal. https:\/\/vancouverisland.ctvnews.ca\/developer-pushes-back-against-victoria-s-call-for-fewer-parking-spaces-at-new-condos-1.6342102\n\n\nLooks like starlight doesn't want to go quite as extreme as the city wants in regards to the parking spaces.\n\nI honestly dont know why the city went so extreme on their reduced parking targets. Not everyone walks and transits everywhere, and not everyone who lives dt works dt.","label":1,"Predicted_Label":0}
{"text":"Victoria Conference Centre to open as city’s second vaccination site on April 12. ","label":0,"Predicted_Label":0}
{"text":"Types of jobs 7:00pm to midnight. What types of part time \/ odd jobs (legal of course) could someone do between the hours of 7pm and midnight.\n\nStocking \/ retail\nPizza \/ delivery\nCall centre?\n\nWhat other kinds of jobs would one look for in victoria with those time constraints?","label":0,"Predicted_Label":0}
{"text":"URGENT! Women Warriors Needed for Topless Hot Yoga in Victoria Tomorrow (thursday) night at 7:30 pm. short version:friend invited me to hot yoga. $10 for a week of unlimited yoga. Went first day, afterwards washed sweaty clothing. Went again for yoga today for a more difficult class than the class I went to the day before. My yoga bra was still wet at home so I just wore a shirt. Got into the yoga room it was much hotter than the previous yoga the day before. I was like I cannot do this in a shirt way too hot. See all these shirtless guys. I go to the front desk and ask if I can do it topless, was told that I could and even got a laugh and they were amused by the request. I do its all good.  Survive yoga. Afterwards I am told that me being topless is a distraction to others and I need to cover up next time I come. I ask if she saw anyone being distracted said that its not common and people did a few looks. I did not press the issue.\n\nI ponder issue.Think FUCK THAT!ITs not on me for other people to not sexualize my bodyI find other peoples boners, abs and tattoos are distracting but it's on the individual to not sexualize people not to shame women.\n\nThis is not equality.Will talk with the owner tomorrow I did not make an issue of it today just not right time and place.SO my plan is to talk to them tomorrow, then have another woman or two that also want to do topless yoga with me for support.Its about the principle.\n\nAnother person would be helpful, also its a bit nerve wracking for me so some support would be good. Afterwards the ladies in the change room actually thanked me for my courage for going topless, when I was really just going to be way to hot and my other top was dirty at home. But I don't like being told that I am a distraction and its my responsibility to hide my body for other people and it also implies that others are incapable of actually controlling themselves.\n\nPlease reply or message me ASAP if your down to join on my topless yoga!\n\nUPDATE!\n\nEmailed owner, wrote email detailing situation and my views of the ethics of the situation. Requested to attend class again tonight with the same rights as a man, to go shirtless. They got back to me and said that their 'private policy which is NOT listed on their site or yoga etiquette stating that their dress code requires women to wear shirts. Offered e a refund and said that I could not go the class.\n\nAs such, looking for people who are interested in doing a all gender topless yoga class! Taking names and kicking ass. Message me if you want to be on the list.\n\nThis conversation is super interesting.\n\n&#x200B;\n\nUPDATE # 2   \n\n\nStory being run on this topic on CTV tonight at 5pm !!! \n\nTune in if your interested! \n\nJoin the Facebook group: topless yoga Victoria if your interested in running a topless hot yoga event here in Victoria.\n\n[https:\/\/www.facebook.com\/groups\/448826935709038\/](https:\/\/www.facebook.com\/groups\/448826935709038\/)","label":0,"Predicted_Label":0}
{"text":"Costco needs another location. Holy smokes. There  use to be times of the day\/week when Costco wasn't bananas but I fear those days are behind us. Shopping during weekday evenings is just as bad as any other time. Maybe worse because the store is so picked over. With all the new folks moving to Victoria and surrounding areas, I can't imagine how busy it's going to get in the next few years. Costco needs a second location on the South Island. Has anyone working for Costco heard rumours, rumblings, sounds of hope that this might happen one day? ","label":1,"Predicted_Label":0}
{"text":"Another Serious Cyclist Accident on Gorge Road East - We Need Action Now. [https:\/\/www.cheknews.ca\/cyclist-suffers-life-threatening-injuries-in-collision-with-vehicle-in-victoria-754329\/](https:\/\/www.cheknews.ca\/cyclist-suffers-life-threatening-injuries-in-collision-with-vehicle-in-victoria-754329\/)\n\nThis evening at Gorge and Bridge a cyclist was struck by a vehicle. I immediately reacted with shock and horror as I was reminded of a very similar accident that happened in the fall just a few blocks away at Gorge and Harriet. Thankfully it sounds like the person involved in today's accident is going to be alright unlike the young woman who was killed in November.  \n[https:\/\/www.vicnews.com\/news\/cyclist-dies-from-injuries-after-friday-night-collision-at-harriet-gorge\/](https:\/\/www.vicnews.com\/news\/cyclist-dies-from-injuries-after-friday-night-collision-at-harriet-gorge\/)  \n\n\nI was a witness to the accident in November and performed CPR at the scene. As a resident of Burnside-Gorge and a driver and cyclist myself I know this is a busy and dangerous street. It isn't fun to drive and it is downright scary to cycle on.   \n\n\nGorge Road is on Victoria's AAA Cycling Network and consultation is scheduled to begin this year however safety improvements cannot wait until sometime late next year. We need interim solutions now!","label":0,"Predicted_Label":0}
{"text":"The wall lizard invasion of Vancouver Island. ","label":0,"Predicted_Label":0}
{"text":"Hosting Ukrainian refugees and volunteering on Vancouver Island. 🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦. Can you help?    Every little bit counts    🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦\n\n[https:\/\/ukrainehelpvi.ca\/?utm\\_source=victoria%20times%20colonist&utm\\_campaign=victoria%20times%20colonist%3A%20outbound&utm\\_medium=referral](https:\/\/ukrainehelpvi.ca\/?utm_source=victoria%20times%20colonist&utm_campaign=victoria%20times%20colonist%3A%20outbound&utm_medium=referral)\n\nOriginally posted in the Times Colonist (March 8th, 2022)\n\n[https:\/\/www.timescolonist.com\/local-news\/vancouver-island-ukrainian-groups-set-up-website-to-centralize-information-5136437](https:\/\/www.timescolonist.com\/local-news\/vancouver-island-ukrainian-groups-set-up-website-to-centralize-information-5136437)\n\nedit: added flags for more visibility in the sub.","label":1,"Predicted_Label":0}
{"text":"Neighbourhoods with the most kids?. I’ve heard that the west shore has lots of kids, especially in new developments like royal bay and west hills, but I’m looking for neighborhoods closer to or in Victoria. The kind of neighborhoods where my kids would be able to go outside and play with other nearby kids.\n\nWe had exactly 1 kid come trick or treating this year. The only kids we see around are the one visiting their grandparents. Where the kids at?","label":1,"Predicted_Label":0}
{"text":"Condo\/Townhouse Construction Companies?. Hey Victoria,\n\nI'm looking into potentially buying a condo\/townhouse to get out of renting, and have seen a few old and new developments around.\n\nDoes anyone have any experience with the build quality of various companies here like Story Construction, Abstract, and Chard? I have tried looking online but haven't really found much info.\n\nI remember reading somewhere long ago for example, that Townline should be avoided since they tend to skip corners, with one of the more prominent examples being the Hudson Walk and its supposedly paper thin walls. \n\nAny feedback\/summary of the construction companies here would be much appreciated!","label":1,"Predicted_Label":0}
{"text":"Does Victoria have much of a gay community?. I'm thinking of moving to Victoria, but I haven't heard nice things about the gay community there.\n\nThe one time I was visiting, I checked out the gay bar there and it was essentially a small, practically empty basement with a few middle-older age guys. And this was on a Friday or Saturday night.\n\nI also talked to a gay UVic student, who said the university (and city in general) has very little gay guys, and a very small inactive community considering the size of the city.\n\nBut I don't want to base my decision on just one student, and an empty gay bar. I do live in Toronto though, and don't want to move to Victoria if the gay community is stunted. I've been through the desolate isolating wasteland that was high school once already, thank you very much :-\/","label":0,"Predicted_Label":0}
{"text":"Do the reddit terms of service allow Victoria News to use our posts as \"news\" reporting?. I can certainly understand a reporter making use of reddit for story attribution or to ask a question, but I see now that one of our subs threads has formed an entire Victoria News article. \nhttps:\/\/www.vicnews.com\/news\/why-are-huge-cranes-in-vic-west-holding-up-tiny-boats\n\nIt just seems odd to me, if you were interviewed and provided a quote in person they would likely ask you if you are ok appearing in the paper but if you post somewhere else they can just copy and print it. What eventually stops them or any outlet from just reprinting whole subreddits and calling it todays paper?","label":0,"Predicted_Label":0}
{"text":"Anyone know where there are tall swings in Victoria or nearby communities?. I love to swing on swings that have a long chains so the arc is large. All of the swings I have found in the area have been short. The largest I have found so far has been Stradacona park which aren't great. Is this just a Victoria thing or what? In Winnipeg almost every park has swings and usually they are quite tall. Stanley park has some awesome ones on the mainland too. Can anyone point me to some big ones around Victoria? ","label":0,"Predicted_Label":0}
{"text":"SD61 Teachers having to choose between safety or learning in our schools. Students education beginning at kindergarten level and beyond is interrupted, evacuated-daily, multiple times a day— because violent students are incapable, or unwilling to safely exist in a classroom or school environment. \n\nExtreme violence towards peers and staff is going without consequence. \n\nHere is a public SD61 meeting that was put on YouTube with a presentation by a local teacher. \n\nhttps:\/\/www.youtube.com\/live\/fBGmnaBAHBk?feature=share&t=1515\n\nHer presentation starts at about 25 minutes in ","label":0,"Predicted_Label":0}
{"text":"Remember me? I shaved half my beard and half my hair off for my driver's license, and now I need your help.... ... to win this [exceedingly stupid contest](https:\/\/apps.facebook.com\/philipssculpt\/gallery?id=224)! All I need is your vote.\n\nGrand prize is a bust of myself, presumably with the stupid haircut, which I think is an appropriate immortalization of a dubious decision. I'll make a midnight installation of it downtown if I win.\n\n[Here's the original thread](http:\/\/www.reddit.com\/r\/pics\/comments\/qcnz3\/i_decided_to_do_a_novelty_drivers_license_how_did\/) if you missed it the first time.","label":0,"Predicted_Label":0}
{"text":"I witnessed a peacock seamlessly use the pedestrian walk at Niagara and Douglas to return to Beacon Hill Park on Wednesday afternoon. Has anyone else seen this?. I was waiting to turn left from Niagara, I saw it approach Douglas in the crosswalk lines. It waited for barely a minute for a southbound lane car to stop and the very next northbound lane car stopped. The peacock then sauntered across without hesitation, like it does it all the dang time!\n\nI've seen them get all the way to the James Bay Thrifty's and environs and now I know how.\n\nSorry, no video as I was driving *:)*","label":0,"Predicted_Label":0}
{"text":"Look who's enjoying Beacon Hill Park. ","label":0,"Predicted_Label":0}
{"text":"Beacon Hill Park Waterfall. ","label":0,"Predicted_Label":0}
{"text":"Optimum Duck Spotting times at Beacon Hill. When are the best times during the year to see ducks  at Beacon Hill? We are considering engagement photos there and would love to include photos of feeding the ducks.","label":0,"Predicted_Label":0}
{"text":"Lost at Hollywood Park - Black Jansport backpack. My niece accidentally left her bag at Hollywood Park on Wednesday evening,  and when she went back the next morning it was gone.  Her ID is in it (BCID or Central Middle School, she's not sure which) and she needs it to get on a flight tomorrow afternoon.\nIf you found her bag, or wallet, please message me ASAP.  \nBag is the same as pictured,  but has a hole in the front pocket.","label":0,"Predicted_Label":0}
{"text":"Census of Unoccupied Homes. The 2016 Census counts the following private dwellings that are not anyone's primary residence. They could be vacation homes, Airbnbs, derelict or investment properties.\n\nCensus area|Total private dwellings|Private dwellings occupied by usual residents|# Unoccupied|% Unoccupied|\n:--|--:|--:|--:|--:|\nSaanich| 49,422| 46,652| 2,770|6%|\nVictoria, City| 49,212| 45,762| 3,450|7%|\nLangford| 14,906| 14,178| 728|5%|\nEsquimalt| 8,742| 8,493| 249|3%|\nOak Bay| 8,122| 7,737| 385|5%|\nCentral Saanich| 7,121| 6,893| 228|3%|\nColwood| 6,867| 6,588| 279|4%|\nSidney| 5,960| 5,603| 357|6%|\nSooke| 5,599| 5,253| 346|6%|\nNorth Saanich| 4,936| 4,626| 310|6%|\nView Royal| 4,299| 4,154| 145|3%|\nJuan de Fuca (unincorporated)|2,337|1,992|345|15%|\nMetchosin| 1,932| 1,818| 114|6%|\nHighlands|862|831|31|4%|\n**Victoria metropolitan area***| **172,559**| **162,716**| **9,843**|**6%**|\n\n\\* Includes reserves.","label":1,"Predicted_Label":1}
{"text":"Thank you, City of Victoria! Cleanest public washroom ever :-). ","label":1,"Predicted_Label":0}
{"text":"Colwood councillor calls for end to religious property tax exemptions. ","label":0,"Predicted_Label":0}
{"text":"Bike from millstream to downtown. Hey all, I used to ride the goose to work all the time so I know it well all the way from wale road in colwood to downtown. Now, looking for the route from millstream - what’s the best way to stay on the north side of the highway and get from millstream to the goose at burnside heading into town?","label":0,"Predicted_Label":0}
{"text":"Westshore name is a wtf? Debate. Wife and I are debating why the western communities are called \"west shore\". The southern tip of the island is south west of Colwood so you'd have to travel clockwise, or west to get there. That implies Colwood is \"eastern\" side of the island. The shore actually faces east or south east. Is it just because it's west of Victoria? No google search shows how that name came about.","label":0,"Predicted_Label":0}
{"text":"Spotted this land yacht in Cook St village. ","label":0,"Predicted_Label":0}
{"text":"Empire Donuts and Fried Chicken thoughts?. Been a long time fan of their Donuts location on Yates so i decided to check out their new business. Here are my thoughts so far\n\nLocation 8\/10 - The old liquor store in Cook street village behind Prima Strada. Hot spot area but its quite hidden.\n\nParking  5\/10 - Kinda crappy actually, There is a pay lot directly infront of it and no free spots. Street parking in the area is often difficult. Still much better than their downtown location.\n\nStaff 8\/10 - Friendly and helpful\n\nSignage 4\/10 - Honestly it is hard to spot. perhaps they should have a light on their sign indicating dounts r in stock :(\n\nSeating  1\/10 - Not a comfortable place to eat in. Two high top small round table with 4 extra small stools surround. Basically a takeout restaurant. Not family friendly at all.\n\nStore and atmosphere 2\/10 - The look and colors are ok but the place is underlit on a cold rainy day. No music and line moves very slow as people hum and haw over donuts.\n\nFood 9\/10 - Honestly their chicken was good ( better than thunderbird chicken 1 block away) and the waffle fries great. I topped it off with a donut to end which was outstanding.\n\nPrice 1\/10 - For 2 piece chicken and waffle fries plus one dount and rootbeer it cost me $25. Too me that is ridiculous. To top off they hand u the meal in a takeout box regardless of eating in. I can have a great topclass meal for $25 at a sitdown restaurant with a full waiter staff topping up my water every second and handing me free bread with an actual plate to eat on.\n\nHours 3\/10 - They are only open till 3pm which kinda sucks. Another thing that sucks is that they run out of donuts often and sometimes by noon which sucks. Going out of your way to go to a local donut shop but seeing a sold out sign at noon makes me not want to come back especially if I just paid for parking.\n\nOverall 6.5\/10 - It has potential if they adjusted some things, get some dedicated parking,get some booths inside and optimize seating, played some music, offered some more beverage options, offer combo deals and reduce the price.\n\nWill this place survive? I am not sure. With stiff competition in the area like big wheel burger, prima strata and newly opened Thunderbird fried chicken better valued good chicken) just a block away they will have to really be on the ball. They will heavily rely on their donut sales to stay in business.\n\n\n\n","label":0,"Predicted_Label":0}
{"text":"What Restaurants\/Cafes Still Have Takeout Windows?. Hi folks, I’m hoping to crowdsource what places in Victoria still have takeout windows, for the higher risk among us. \n\nI know of Hidden Gem and Hot and Cold Cafe in Cook St Village, as well as Little Thai Place and Cold Comfort in North Park. \n\nWould very much appreciate hearing any you’re aware of.\n\nETA: Thank you to all who have shared. This immunocompromised person is very thankful.\n\nAnd LOL to all the downvotes. I can only imagine these are people enraged by the idea of someone taking precautions against COVID so they don’t die.","label":0,"Predicted_Label":0}
{"text":"galloping goose condition?. i'm wondering whether i will be able to bike to work tomorrow. thoughts?  from cook st. village to broadmead.","label":0,"Predicted_Label":0}
{"text":"Apartment availability at a glance. &#x200B;\n\n[Was sent this list from CAPREIT. Thought some folks might be interested.](https:\/\/preview.redd.it\/k1jl1zyif92b1.png?width=953&format=png&auto=webp&s=bb860c5f36732674ba96d7d623650c282a1d0056)","label":1,"Predicted_Label":0}
{"text":"Are you a beginner cyclist looking for a goal? (And bike friends?). Many of us have taken the recent social slow down as a time to get back on a bike. Cycling has become a real driver for me and I look forward to my rides all day. I want to keep this fire lit, so I decided the GranFondo, a ride from Stanley Park to Whistler, would be a fun and reasonable goal to work towards for Summer 2021. \n\nPre-covid, we had an impromptu r\/victoriabc meet up in Cook St Village and it was a great time. All the positive interest made me realize that there are lots of people on here seeking connection in the city. I am wondering if there are others on here that are also beginner cyclists and would want to train together? I’m not necessarily suggesting group rides, because that could prove tricky to coordinate, but more a supportive team to meet at the park, share progress, fun stories and offer support! \n\nI am a beginner that has invested in a decent bike, and can get about 30km right now before getting jelly legs. I’d love to find some like minded people to build up to 122km and 1900m of elevation with! \n\nIf anyone is interested in becoming bike friends, let me know! It’d be awesome to get a group together in the next week or two.","label":0,"Predicted_Label":0}
{"text":"Anyone want a free TV? . My cousin has a 36\" CRT TV that he is going to bring to recycling. It's an RCA and works great. They just got a new TV and don't need this one. \nI figured there maybe a Vic Redditor that cold put it to use. \n\nJust come pick it up and it's yours. They live by Cook St village. \n\nLet me know if you want it and I'll set it up. ","label":0,"Predicted_Label":0}
{"text":"Lost Golden Reteiver in Mt. Doug area. UPDATE DECEMBER 6, 10:53PM: Rosie has been found! Rosie turned up at a friends house very close to Lambrick Park, very tired and dehydrated, but other than that she's in good shape. We are very grateful to all who helped look for her. Please consider donating to ROAM. They are a fantastic group of volunteers.\n\n-----------------------------------------------------------------\nUPDATE December 6, 9:24 pm: Rosie is still missing. But there were two confirmed sitings today:\n7am at Lambrick Park tennis courts (Gorden Head Rec Center) by road workers who called ROAM.\n3pm at San Pedro Ave. and San Ardo Pl. (Gordon Head Sierra Park area).\nWe believe she is still in the area tonight.\n\nBIG shout out to ROAM for all their help. What a wonderful organization. Their volunteers have put in an amazing effort to help us find Rosie. They got the word out quickly, put up posters, and even cooked bacon in Lambrick Park tonight in the hope of luring Rosie back to her family. I would also like to thank all the residents of Gordon Head who walk the streets in the evening with and without their dogs. Everyone seems to know about Rosie and is keeping an eye out. Hopefully, we will be reunited soon.\n \n----------------------------------------------------------------\nOur 2.5 year old Golden, \"Rosie\", was last seen around 2pm this afternoon at Feltham and Shelbourne after going for a walk up Mt. Doug. Roam has been notified. https:\/\/roambc.org\/2018\/12\/05\/lost-dog-rosie-4\/\n\nIf in the area, please keep an eye out for our beloved family member. Rosie is wearing a collar with our phone number. If you see a stray dog that meets Rosie's description, please call Roam at 778 977-6265.\n\nThank you. \n\n","label":0,"Predicted_Label":0}
{"text":"Oldfield Road closed, as is West Saanich. West Saanich is closed just north of Prospect Lake Road.  Oldfield Road closed just north of Brookleigh Road.  Note that these are the southern closures: I don't know where they are closed north of these spots.\n\nUpdated as of about 8 this morning.","label":0,"Predicted_Label":1}
{"text":"Schools for child with autism (high-functioning). Would love thoughts and insights on schools in the Victoria district to seek out\/avoid in terms of supporting kids on the autism spectrum. We are planning a move before kindergarten starts partly because our catchment school (South Park) seems to be poorly regarded in this area. We hear Saanich district as a whole gets better reviews on this front, but specifically interested in our Victoria options.","label":0,"Predicted_Label":0}
{"text":"Drop in hockey?. Is there anywhere still doing drop in hockey? I really need to get back on the ice but all my local rinks in North saanich are by booking only and nowhere seems to be doing drop in.\n\nDoes anyone have a booking and need an extra skater or know of anywhere to get some ice time?\n\nThanks!","label":0,"Predicted_Label":0}
{"text":"RV overnight parking on street. I'm heading to North Saanich from the mainland to pickup a camping trailer and didn't want to turn around and head back the same day.  I'd like to just park my truck and trailer on a side street in Victoria and hang out for the night (and drink) downtown then just sleep in the trailer and head out first thing in the morning.  \n  \nI found some forums online with people discussing parking bylaws for residential streets, but they only seem to talk about parking for visitors in general, not RVs.  I've heard the the Walmart in Victoria does not allow overnight parking as the lot is maintained by the mall, not Walmart.  \n  \nDoes anyone know if I will get ticketed\/towed if I find a quiet street with lots of room so I'm not stealing a spot from a resident?  Or maybe another suggestion?  \n  \nThanks.","label":1,"Predicted_Label":0}
{"text":"Ongoing vandalism pushes downtown Victoria businesses to consider relocating. ","label":1,"Predicted_Label":0}
{"text":"Public to weigh in on five-tower, 1,500-unit downtown Victoria rental proposal on February 9th | Citified.ca. ","label":1,"Predicted_Label":0}
{"text":"Victoria council agrees to spend $400,000 on new downtown washroom. ","label":1,"Predicted_Label":0}
{"text":"Great New Restaurant in Esquimalt!. ","label":0,"Predicted_Label":0}
{"text":"The Esquimalt Lagoon at night. ","label":0,"Predicted_Label":0}
{"text":"Looking for restaurant or pub with semi\/private event area.. I think it has fallen to me to whip a Christmas party together for my office. I cant imagine we would number more than 20. Can anyone please recommend a place where we could eat and then it wouldn't be a hassle to get up and walk around and talk amongst ourselves? Thank you. ","label":0,"Predicted_Label":0}
{"text":"Car accident at Oak Bay ave and Foul bay rd, anyone with video footage?. I got rear ended at the stop light today at 3:30, and am looking for dash cam footage. A white SUV hit a stopped grey hatchback, which hit a blue hatchback. Any help would be appreciated.","label":0,"Predicted_Label":0}
{"text":"Delivery App in Victoria?. I'm looking for an app\/program for small business delivery scheduling and tracking. Anyone in Victoria have experience that they want to pass on? Its only for 10 stops max\/day, so I'm hoping to find something free or on the cheap end.\n\nI'd like something that:\n\n\\-Tracks the route\/kilometres\/time taken (most importantly)\n\n\\-Has a schedule feature so we can have at least the next week viewable\/editable\n\n\\-Organizes the stops for best route, preferably able to prioritize a stop or time a stop (ex. 333 Foul Bay Rd at 11:45am)\n\nI had no idea where to start, there are so many out there. This might be more appropriate for a tech page? I thought I would start with any local knowledge ;) Thanks for anything you can pass on!","label":0,"Predicted_Label":0}
{"text":"Humboldt rd at st. Anne's, is it one way now?. Not to waste anyone's time but not sure who else to ask. \nI haven't driven the section in front of st. Anne's academy recently, but turned down there today on my way to Beacon Hill. I didnt see anything that said one way but I turned on to it from blanshard  to see only 1 lane now and a car coming my way. There's no yellow line, just a single centre lane. I pulled into a parking spot and waited. Once it left I went but I saw another car come the same way I did so it doesn't seem like one way. But there's only one lane so two cars won't fit. \n\nAnyone enlighten me? Thanks!","label":0,"Predicted_Label":0}
{"text":"Thx to Those Who Helped Me on Sat Morning, Bay St. I didn't get to thank everyone who helped, including the ones who chased the truck.  I hope I didn't get any blood on the blankets.\n\nI was cycling on Bay St, heading towards RJH when a truck decided they wanted to turn left (to head towards DT) more than look left to respect traffic\/laws.  I'd seen them stop before crossing the sidewalk, and considering parked cars on the street - expected the truck to pull out further to see.  But they just kept creeping out...\n\nI couldn't brake in time, chose to go left (in front of the vehicle) in hopes of driver seeing me and it was the shortest distance to clear.  I almost crossed the center line before I was hit on my right, witnesses said I flew 10-15 ft.  The truck took off, leaving me in the street with a broken collarbone on my left, and crush injuries to my right hand.  It'll be a week before the stitches come out, and 6 weeks before I can resume running, cycling, and swimming.  I call today for some word on the status of my bike - I was told the handlebars were toast already.\n\nThe truck did come back, police gave the driver a \"failure to yield\" as witnesses confirmed my version of the events (in so many words from the officer).  The incident occurred at ~9 AM; I was wearing a helmet.  This did not need to happen.","label":0,"Predicted_Label":0}
{"text":"Severed foot washed ashore (this time at Gonzales Beach). ","label":0,"Predicted_Label":0}
{"text":"Statistically (based on long-term averages) today is the sunniest and driest day of the year in Victoria. ","label":0,"Predicted_Label":0}
{"text":"Coming to Victoria next week, and I'm super excited!. Hello \/r\/VictoriaBC!  I'll be arriving in your fair city this coming Monday for 4 days, and I would love some suggestions for things to do while I am there.\n\nPart of my time will be spent on the University of Victoria campus for the Congress of the Humanities and Social Sciences, but the rest of my time is completely unplanned.  What are some awesome (yet affordable!) things that I simply must see?  Must do?  Is now a good time to go whale watching?\n\nAs a born and raised Ontarian having only visited Victoria in the past for one night, I am determined to make the most of my 4 short days!","label":0,"Predicted_Label":0}
{"text":"First to get the reduced speed limit signs: Quadra-Hillside. 30Km\/h [https:\/\/www.timescolonist.com\/local-news\/quadra-hillside-first-to-get-reduced-speed-limit-signs-6774355](https:\/\/www.timescolonist.com\/local-news\/quadra-hillside-first-to-get-reduced-speed-limit-signs-6774355)","label":0,"Predicted_Label":0}
{"text":"Island Health vaccination clinics availability changes.. ","label":0,"Predicted_Label":0}
{"text":"Questions about Island Health's Covid testing waitlist. Just wondering if anyone has experience with the waitlist that Island Health has setup? My girlfriend signed up for a test and immediately received a text telling her she was number 800 and something on the waitlist, but when I signed up, they didn't text me anything and won't let me register again. \n\nIf you're been on the waitlist, how long did you wait?\n\nThanks!","label":0,"Predicted_Label":0}
{"text":"Island Health Job Application Question. Hey all, \n\nI'm a registered nurse who has recently relocated to Victoria. I've been applying to jobs through the Island Health public job postings and have a question about common-practice when following up job postings.\n\nIn Alberta where I previously worked AHS strongly discouraged job applicants from following up applications done online. Is it the same here? I recently applied for a street-nurse position that I REALLY REALLY want, but I dont want to turn off anyone by breaking protocol or common practice. ","label":0,"Predicted_Label":0}
{"text":"Good Nursing Homes in Victoria?. Hey Reddit,\n\nmy family and I have just started looking into nursing homes for my grandparents and we're having a hard time deciding which ones to get on the wait list with. My mom is having a really hard time with this decision so I'm trying to ease her stress as much as possible and find out if anyone here has any experience with any of the facilities. Any recommendations\/cautionary tales? \n\nThanks. ","label":1,"Predicted_Label":0}
{"text":"The hills of the Pacific Marine Route.. ","label":0,"Predicted_Label":0}
{"text":"Lost phone in Oak Bay.  I lost my phone yesterday somewhere between Willows beach and the Jubilee (big area, I know). It is an Iphone 7 with a pink\/red see throughish case. It might be dead but if not, my ragdoll cat is my background. Lost sometime between 5pm to 2am yesterday. Please let me know if you found it.","label":0,"Predicted_Label":0}
{"text":"Have you seen this guy?. ","label":0,"Predicted_Label":0}
{"text":"Learn the history of Oak Bay’s picturesque memorial cenotaph - Unseen pics document the memorial’s creation. ","label":0,"Predicted_Label":0}
{"text":"Any idea what the details are of funeral on West Saanich Rd just north of Brentwood?. Was out driving and there is a huge turnout for a funeral at the church along West Saanich Rd just north of Brentwood Bay. I did a Google search but not getting any info. It just seems like a much larger event than normal as they had a couple of RCMP doing traffic so I was wondering who it is.","label":0,"Predicted_Label":0}
{"text":"BC Rugby - Vikes Split Victories With UBCOB Ravens : Photo Essay. ","label":0,"Predicted_Label":0}
{"text":"Crews respond to sediment runoff into Colquitz River - Thousands of gallons of sediment flows into Colquitz River near work on McKenzie interchange for Highway 1. ","label":0,"Predicted_Label":0}
{"text":"Young people wanted: Vancouver Island community associations lack youth voices - Citizen Advisory Committee Chair John Schmuck says Saanich, B.C., neighbourhoods not properly represented. ","label":1,"Predicted_Label":0}
{"text":"Saanich’s famous Tuxedo Drive Christmas display for sale - Last year for famous Tuxedo Drive Christmas display, unless you want to buy it. ","label":0,"Predicted_Label":0}
{"text":"CF-18 lowered the boom over Saanich Sunday - Plane was arriving in Victoria region from Boise, ID. ","label":0,"Predicted_Label":0}
{"text":"Poets band to together to protect Pacific Ocean - Saanich News. ","label":0,"Predicted_Label":0}
{"text":"Green Team gives Gonzales Beach a going-over - Saanich News. ","label":0,"Predicted_Label":0}
{"text":"Raiders edged by Rebels in home opener - The Westshore Rebels beat the V.I. Raiders 27-25 in BCFC action on Saturday in Nanaimo. ","label":0,"Predicted_Label":0}
{"text":"Mayors' Council approves first phase of TransLink's expansion plan. ","label":0,"Predicted_Label":0}
{"text":"Did anyone listen to MOVE 103.5 FM this morning, November 21st?. I usually catch the Nat and Drew show on a daily basis in hopes of winning the Swift tickets, but I missed it this morning. Did anyone catch who the winner was this morning? And did they have to redraw a name?\n\n&#x200B;\n\nMy daughter is a huge swiftie and I would love to win it for this Christmas","label":0,"Predicted_Label":0}
{"text":"Ridge Meadows RCMP release break-and-enter suspect caught by homeowner. ","label":0,"Predicted_Label":0}
{"text":"Comments made at anti-SOGI rally in Kelowna ‘alarming,’ ‘frightening’, advocate says - Okanagan. ","label":0,"Predicted_Label":0}
{"text":"Why are Whistler Blackcomb 1-day lift tickets $299? - BC. ","label":0,"Predicted_Label":0}
{"text":"Bear tree in Prince George. ","label":0,"Predicted_Label":0}
{"text":"Jeopardy: BC Edition. ","label":0,"Predicted_Label":0}
{"text":"how to find a cheap place to live in BC, Canada?. hello! hope everyone is doing good!!\n\ni hope this is allowed to be posted here, if not please let me know1!\n\nim going to uni in canada but the uni doesnt offer and rooming, id be an international student so its harder to find places and im not sure how the rooming system works, does anyone know of places i could check out in BC? GEC living seemed pretty good but the price is way too expensive, my parents told me my budget should be under 800 atmost so i was wondering if anyone knew a place i could check (similar to gec living, or just any other type of system they have in canada)\n\nedit: my college is in **burnaby** but im willing to live in another city since i could use the train\/bus\/metro system\n\nother questions\/answers:\n\n* location: burnaby but willing to live in other cities close by\n* Is your program remote or do you have to attend in-person: i would be attending in-person\n* Are you able to adjust your expectations or how much would you be willing to increase on your monthly expense threshold: as of right now im not sure what my monthly expenses would be since my parents havent given me a set number but i'd be able to cut my food expenses to really low and would be spending most of my money only on rent and transport","label":1,"Predicted_Label":0}
{"text":"Lifelong Indigenous language advocate dedicates degree to Tlingit heritage. ","label":0,"Predicted_Label":0}
